
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>粒子与尾迹参数 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter5.html" />
    
    
    <link rel="prev" href="Chapter3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    软件界面及基础功能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    网格渲染相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    骨骼动画相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    粒子与尾迹参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    3ds Max相关内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Chapter6.html">
            
                <a href="Chapter6.html">
            
                    
                    编辑器的指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="Share1.html">
            
                <a href="Share1.html">
            
                    
                    来自火焰库拉关于ini的分享
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="Share2.html">
            
                <a href="Share2.html">
            
                    
                    来自火焰库拉关于粒子的分享
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >粒子与尾迹参数</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7C92;&#x5B50;&#x4E0E;&#x5C3E;&#x8FF9;&#x53C2;&#x6570;">&#x7C92;&#x5B50;&#x4E0E;&#x5C3E;&#x8FF9;&#x53C2;&#x6570;</h1>
<p>&#x6559;&#x7A0B;&#x4EC5;&#x8BB2;&#x89E3;&#x5404;&#x4E2A;&#x53C2;&#x6570;&#x5355;&#x72EC;&#x4F5C;&#x7528;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5404;&#x79CD;&#x7EC4;&#x5408;&#x6548;&#x679C;&#x8FD8;&#x8BF7;&#x5404;&#x4F4D;&#x8865;&#x4E01;&#x4F5C;&#x8005;&#x81EA;&#x884C;&#x4FEE;&#x6539;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;">&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;</h2>
<p>&#x7C92;&#x5B50;&#x662F;&#x6574;&#x4E2A;X&#x6587;&#x4EF6;&#x4E2D;&#x6700;&#x590D;&#x6742;&#xFF0C;&#x4E5F;&#x662F;&#x6700;&#x5F3A;&#x5927;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#xFF0C;&#x4F5C;&#x4E3A;&#x7F51;&#x683C;&#x7279;&#x6548;&#x7684;&#x8F85;&#x52A9;&#x5143;&#x7D20;&#xFF0C;&#x4E0D;&#x540C;&#x7C92;&#x5B50;&#x7684;&#x642D;&#x914D;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x65E0;&#x6570;&#x79CD;&#x72EC;&#x7279;&#x7684;&#x6548;&#x679C;&#xFF08;<del>&#x540C;&#x65F6;&#x5176;&#x53EF;&#x4FEE;&#x6539;&#x53C2;&#x6570;&#x4E5F;&#x591A;&#x5F97;&#x4EE4;&#x4EBA;&#x53D1;&#x6307;</del>&#xFF09;&#x3002;&#x4E0B;&#x56FE;&#x4E3A;&#x9009;&#x4E2D;&#x7C92;&#x5B50;&#x540E;&#x7684;&#x9884;&#x89C8;&#x7ED3;&#x6784;&#xFF0C;&#x7531;&#x4E00;&#x6761;&#x7EFF;&#x8272;&#x7EBF;&#x6BB5;&#x3001;&#x4E00;&#x6761;&#x84DD;&#x8272;&#x7EBF;&#x6BB5;&#x3001;&#x56DB;&#x6761;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x4EE3;&#x8868;&#x7C92;&#x5B50;&#x53D1;&#x751F;&#x5668;&#xFF0C;&#x7531;&#x5341;&#x5B57;&#x5F62;&#x72B6;&#x4EE3;&#x8868;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x3002;&#x65E7;&#x7248;&#x672C;&#x7684;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#xFF0C;&#x90E8;&#x5206;&#x7C92;&#x5B50;&#x7684;&#x65B9;&#x5411;&#x4F1A;&#x6709;&#x663E;&#x793A;&#x9519;&#x8BEF;&#xFF0C;&#x65B0;&#x7248;&#x672C;&#x5DF2;&#x7ECF;&#x4FEE;&#x590D;&#x3002;</p>
<center>
<img src="assets/particle_preview.png" width="60%">
</center>

<h3 id="&#x7C92;&#x5B50;&#x540D;&#x79F0;">&#x7C92;&#x5B50;&#x540D;&#x79F0;</h3>
<p>&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x8981;&#x6C42;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4E0E;&#x7F51;&#x683C;&#x4E00;&#x6837;&#xFF0C;&#x7279;&#x5B9A;&#x540D;&#x79F0;&#x7684;&#x7C92;&#x5B50;&#x4F1A;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x663E;&#x793A;&#x6761;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x540D;&#x5B57;&#x591A;&#x4EE5;<code>_hide</code>&#x4E3A;&#x540E;&#x7F00;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7C92;&#x5B50;&#x540D;&#x79F0;&#x4E5F;&#x53EF;&#x4EE5;&#x5BB9;&#x7EB3;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x53C2;&#x7167;&#x4F0A;&#x8389;&#x96C5;&#x9A6C;&#x7334;&#x70E7;&#x9152;&#x76AE;&#x80A4;&#x7684;&#x7FC5;&#x8180;&#x7C92;&#x5B50;&#x3002;</p>
<center>
<img src="assets/particle_name.png">
</center>

<h3 id="&#x8DDF;&#x968F;&#x89D2;&#x8272;&#x79FB;&#x52A8;">&#x8DDF;&#x968F;&#x89D2;&#x8272;&#x79FB;&#x52A8;</h3>
<p>&#x6307;&#x793A;&#x7C92;&#x5B50;&#x5728;&#x53D1;&#x5C04;&#x4E4B;&#x540E;&#x662F;&#x5426;&#x4E0E;&#x7ED1;&#x5B9A;&#x9AA8;&#x9ABC;&#x4FDD;&#x6301;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x3002;&#x52FE;&#x9009;&#x5219;&#x7C92;&#x5B50;&#x53D1;&#x5C04;&#x4E4B;&#x540E;&#x4ECD;&#x4F1A;&#x8DDF;&#x968F;&#x7ED1;&#x5B9A;&#x7684;&#x9AA8;&#x9ABC;&#x8FDB;&#x884C;&#x8FD0;&#x52A8;&#xFF0C;&#x4E0E;&#x9AA8;&#x9ABC;&#x4FDD;&#x6301;&#x76F8;&#x5BF9;&#x5750;&#x6807;&#xFF1B;&#x53CD;&#x4E4B;&#x5219;&#x4E0E;&#x9AA8;&#x9ABC;&#x65E0;&#x5173;&#xFF0C;&#x5411;&#x56FA;&#x5B9A;&#x65B9;&#x5411;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#x3002;&#x56FE;&#x793A;&#x4E3A;&#x9ED1;&#x5CA9;&#x5954;&#x8DD1;&#x52A8;&#x753B;&#x65F6;&#x706B;&#x7130;&#x7C92;&#x5B50;&#x8DDF;&#x968F;&#x89D2;&#x8272;&#x79FB;&#x52A8;&#x7684;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x6548;&#x679C;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_a.png" width="45%">
<img src="assets/follow_char.png" width="45%">
</center>

<h3 id="&#x7ED1;&#x5B9A;&#x5230;&#x9AA8;&#x9ABC;">&#x7ED1;&#x5B9A;&#x5230;&#x9AA8;&#x9ABC;</h3>
<p>&#x5F00;&#x542F;&#x540E;&#xFF0C;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x4F1A;&#x65F6;&#x7EC8;&#x4FDD;&#x6301;&#x4E0E;&#x9AA8;&#x9ABC;&#x7684;&#x76F8;&#x5BF9;&#x4F4D;&#x7F6E;&#x4E0D;&#x53D8;&#xFF08;&#x4E0E;&#x91CD;&#x5408;&#x4E0D;&#x540C;&#xFF09;&#xFF0C;&#x4E0D;&#x4F1A;&#x76F8;&#x5BF9;&#x9AA8;&#x9ABC;&#x8FDB;&#x884C;&#x79FB;&#x52A8;&#x3002;&#x56FE;&#x793A;&#x4E3A;&#x7ED1;&#x5B9A;&#x9AA8;&#x9ABC;&#x7684;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x6548;&#x679C;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_a.png" width="45%">
<img src="assets/bind_bone.png" width="45%">
</center>

<h3 id="&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x653E;&#x5C04;">&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x653E;&#x5C04;</h3>
<p>&#x5F00;&#x542F;&#x540E;&#xFF0C;&#x8D34;&#x56FE;&#x7684;&#x4E0A;&#x65B9;&#x5C06;&#x6307;&#x5411;&#x7C92;&#x5B50;&#x7684;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#xFF0C;&#x7528;&#x4E8E;&#x5C04;&#x7EBF;&#x72B6;&#x7684;&#x7C92;&#x5B50;&#x5236;&#x4F5C;&#x3002;&#x56FE;&#x4E3A;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x653E;&#x5C04;&#x7684;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x6548;&#x679C;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_b.png" width="45%">
<img src="assets/radial_tex.png" width="45%">
</center>

<h3 id="&#x4E0D;&#x671D;&#x5411;&#x6444;&#x50CF;&#x673A;">&#x4E0D;&#x671D;&#x5411;&#x6444;&#x50CF;&#x673A;</h3>
<p>&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7C92;&#x5B50;&#x7CFB;&#x7EDF;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x90FD;&#x662F;&#x9762;&#x5411;&#x7740;&#x73A9;&#x5BB6;&#x89C2;&#x5BDF;&#x89C6;&#x89D2;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5B83;&#x9762;&#x5411;&#x7684;&#x65B9;&#x5411;&#x4E0D;&#x662F;&#x73A9;&#x5BB6;&#x89C6;&#x89D2;&#xFF0C;&#x800C;&#x662F;&#x5176;&#x81EA;&#x8EAB;&#x53D1;&#x5C04;&#x7C92;&#x5B50;&#x7684;&#x65B9;&#x5411;&#x3002;&#x56FE;&#x793A;&#x4E3A;&#x6B64;&#x9009;&#x9879;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_c.png" width="45%">
<img src="assets/not_toward_camera.png" width="45%">
</center>

<h3 id="&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;">&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;</h3>
<p>360&#x5EA6;&#x65E0;&#x6B7B;&#x89D2;&#x5168;&#x65B9;&#x4F4D;&#x6253;&#x51FB;&#xFF01;&#x56FE;&#x793A;&#x4E3A;&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x6548;&#x679C;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_d.png" width="45%">
<img src="assets/rand_launch_dir.png" width="45%">
</center>

<h3 id="&#x9ED1;&#x8272;&#x900F;&#x660E;">&#x9ED1;&#x8272;&#x900F;&#x660E;</h3>
<p>&#x5BF9;&#x4E8E;&#x7C92;&#x5B50;&#xFF0C;&#x6E38;&#x620F;&#x9ED8;&#x8BA4;&#x4FBF;&#x4F1A;&#x5C06;&#x8D34;&#x56FE;&#x7684;&#x9ED1;&#x8272;&#x90E8;&#x5206;&#x66FF;&#x6362;&#x4E3A;&#x900F;&#x660E;&#xFF0C;&#x8FD9;&#x662F;&#x9ED1;&#x8272;&#x7C92;&#x5B50;&#x4F1A;&#x900F;&#x660E;&#x7684;&#x539F;&#x56E0;&#x3002;&#x52FE;&#x9009;&#x4E4B;&#x540E;&#x9ED1;&#x8272;&#x90E8;&#x5206;&#x4F1A;&#x88AB;&#x6E38;&#x620F;&#x8BC6;&#x522B;&#x4E3A;&#x900F;&#x660E;&#x901A;&#x9053;&#xFF0C;&#x672A;&#x52FE;&#x9009;&#x5219;&#x53CD;&#x4E4B;&#x3002;&#x5236;&#x4F5C;&#x9ED1;&#x8272;&#x534A;&#x900F;&#x660E;&#x7C92;&#x5B50;&#x5373;&#x4ECE;&#x6B64;&#x5904;&#x5165;&#x624B;&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x8D34;&#x56FE;&#x65B9;&#x5411;">&#x968F;&#x673A;&#x8D34;&#x56FE;&#x65B9;&#x5411;</h3>
<p>&#x4E0E;&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#x7C7B;&#x4F3C;&#xFF0C;&#x8FD9;&#x6B21;&#x968F;&#x673A;&#x7684;&#x662F;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#xFF01;&#x56FE;&#x793A;&#x4E3A;&#x968F;&#x673A;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x5F00;&#x542F;&#x4E0E;&#x5173;&#x95ED;&#x6548;&#x679C;&#x3002;&#x5728;&#x53C2;&#x6570;&#x8C03;&#x6574;&#x7A97;&#x53E3;&#x4E2D;&#x90E8;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8D34;&#x56FE;&#x968F;&#x673A;&#x65B9;&#x5411;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x9488;&#x5BF9;&#x5E8F;&#x5217;&#x8D34;&#x56FE;&#x7684;&#x968F;&#x673A;&#x65B9;&#x5411;&#xFF08;<del>&#x867D;&#x7136;&#x4E0D;&#x660E;&#x767D;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x6709;&#x4E24;&#x4E2A;&#x968F;&#x673A;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x8981;&#x4E24;&#x4E2A;&#x540C;&#x65F6;&#x90FD;&#x4FEE;&#x6539;&#x5E94;&#x8BE5;&#x5C31;&#x6CA1;&#x95EE;&#x9898;&#x4E86;&#x5427;&#xFF01;</del>&#xFF09;&#x3002;</p>
<p>&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x9700;&#x4E0E;&#x4E0B;&#x65B9;&#x7684;&#x201C;&#x968F;&#x673A;&#x65B9;&#x5411;&#x201D;&#x53C2;&#x6570;&#x76F8;&#x914D;&#x5408;&#xFF0C;&#x6B64;&#x53C2;&#x6570;&#x9ED8;&#x8BA4;&#x4E3A;360&#xFF0C;&#x5373;&#x4E3A;360&#x5EA6;&#x5185;&#x968F;&#x673A;&#x751F;&#x6210;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x3002;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x6B64;&#x6570;&#x503C;&#x4EE5;&#x9650;&#x5236;&#x8D34;&#x56FE;&#x968F;&#x673A;&#x7684;&#x89D2;&#x5EA6;&#x3002;</p>
<center class="half">
<img src="assets/part_compare_e.png" width="45%">
<img src="assets/rand_texture_dir.png" width="45%">
</center>

<h3 id="&#x4E00;&#x95EA;&#x5373;&#x901D;">&#x4E00;&#x95EA;&#x5373;&#x901D;</h3>
<p>&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x4E0E;&#x7C92;&#x5B50;&#x7ED1;&#x5B9A;&#x9AA8;&#x9ABC;&#x7684;&#x663E;&#x793A;&#x5E27;&#x6570;&#x76F8;&#x5173;&#x3002;&#x6B63;&#x5E38;&#x7C92;&#x5B50;&#x5728;&#x7ED1;&#x5B9A;&#x9AA8;&#x9ABC;&#x53EF;&#x89C1;&#x7684;&#x5E27;&#x6570;&#x90FD;&#x4F1A;&#x53D1;&#x5C04;&#x65B0;&#x7C92;&#x5B50;&#xFF0C;&#x4F46;&#x52FE;&#x9009;&#x4E86;&#x8FD9;&#x4E00;&#x9879;&#x5219;&#x53EA;&#x5728;&#x7ED1;&#x5B9A;&#x9AA8;&#x9ABC;&#x6BCF;&#x6B21;&#x7531;&#x4E0D;&#x53EF;&#x89C1;&#x53D8;&#x4E3A;&#x53EF;&#x89C1;&#x7684;&#x90A3;&#x4E00;&#x5E27;&#x53D1;&#x5C04;&#x65B0;&#x7C92;&#x5B50;&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x7C92;&#x5B50;&#x5927;&#x5C0F;">&#x968F;&#x673A;&#x7C92;&#x5B50;&#x5927;&#x5C0F;</h3>
<p>&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x4E86;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x662F;&#x5426;&#x4F1A;&#x4EE5;&#x968F;&#x673A;&#x5927;&#x5C0F;&#x51FA;&#x73B0;&#x3002;&#x9700;&#x4E0E;&#x4E0B;&#x65B9;&#x7684;&#x201C;&#x968F;&#x673A;&#x5927;&#x5C0F;&#x201D;&#x53C2;&#x6570;&#x76F8;&#x914D;&#x5408;&#xFF0C;&#x6307;&#x5B9A;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x7684;&#x4E0A;&#x9650;&#x4E0E;&#x4E0B;&#x9650;&#xFF0C;&#x65B0;&#x7C92;&#x5B50;&#x7684;&#x5927;&#x5C0F;&#x5C06;&#x5728;&#x6B64;&#x533A;&#x95F4;&#x5185;&#x968F;&#x673A;&#x4EA7;&#x751F;&#xFF0C;1.0&#x5373;&#x4E3A;&#x539F;&#x672C;&#x7684;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#x8BBE;&#x7F6E;&#x4E3A;0.5&#x548C;1.5&#xFF0C;&#x5219;&#x4F1A;&#x5C06;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x5728;0.5&#x500D;&#x4E0E;1.5&#x500D;&#x4E4B;&#x95F4;&#x968F;&#x673A;&#x3002;</p>
<p>&#x6B64;&#x5904;&#x7684;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x500D;&#x6570;&#x4F1A;&#x4E0E;&#x4E0B;&#x65B9;&#x7684;&#x201C;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x201D;&#x53C2;&#x6570;&#x76F8;&#x4E58;&#x83B7;&#x5F97;&#x5B9E;&#x9645;&#x663E;&#x793A;&#x7684;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x3002;&#x56FE;&#x793A;&#x4E3A;&#x7C92;&#x5B50;&#x5927;&#x5C0F;&#x5728;0.1&#x548C;2.0&#x533A;&#x95F4;&#x5185;&#x968F;&#x673A;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<center>
<img src="assets/random_size.png" width="60%">
</center>

<h3 id="&#x53D1;&#x5C04;&#x901F;&#x5EA6;">&#x53D1;&#x5C04;&#x901F;&#x5EA6;</h3>
<p>&#x524D;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x7C92;&#x5B50;&#x7684;&#x57FA;&#x7840;&#x53D1;&#x5C04;&#x901F;&#x5EA6;&#xFF0C;&#x53CD;&#x6620;&#x4E3A;&#x7C92;&#x5B50;&#x9884;&#x89C8;&#x7ED3;&#x6784;&#x4E2D;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x540E;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x5728;&#x53D1;&#x5C04;&#x901F;&#x5EA6;&#x57FA;&#x7840;&#x4E4B;&#x4E0A;&#x7684;&#x968F;&#x673A;&#x91CF;&#xFF0C;&#x4F8B;&#x5982;&#x586B;&#x5199;100&#x548C;50&#x5C31;&#x4EE3;&#x8868;&#x5B9E;&#x9645;&#x7684;&#x53D1;&#x5C04;&#x901F;&#x5EA6;&#x5728;&#xFF08;100$\pm$25%&#xFF09;&#x4E4B;&#x95F4;&#x968F;&#x673A;&#x4EA7;&#x751F;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5355;&#x4F4D;&#x957F;&#x5EA6;/&#x79D2;&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x89D2;&#x5EA6;">&#x968F;&#x673A;&#x89D2;&#x5EA6;</h3>
<p>&#x5E26;&#x6709;&#x9650;&#x5236;&#x7684;&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#xFF0C;&#x53CD;&#x6620;&#x4E3A;&#x7C92;&#x5B50;&#x9884;&#x89C8;&#x7ED3;&#x6784;&#x4E2D;&#x56DB;&#x6761;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x7684;&#x5939;&#x89D2;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5EA6;&#x3002;&#x5B9E;&#x9645;&#x7684;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#x5C06;&#x5728;&#x56DB;&#x6761;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x7EC4;&#x6210;&#x7684;&#x5706;&#x9525;&#x4F53;&#x4E2D;&#x968F;&#x673A;&#x4EA7;&#x751F;&#x3002;&#x6B64;&#x9879;&#x4E0E;&#x524D;&#x65B9;&#x4ECB;&#x7ECD;&#x7684;&#x201C;&#x968F;&#x673A;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#x201D;&#x53C2;&#x6570;&#x65E0;&#x6CD5;&#x5171;&#x540C;&#x4F5C;&#x7528;&#x3002;</p>
<h3 id="&#x751F;&#x547D;&#x5468;&#x671F;">&#x751F;&#x547D;&#x5468;&#x671F;</h3>
<p>&#x7C92;&#x5B50;&#x4ECE;&#x53D1;&#x5C04;&#x5230;&#x6D88;&#x5931;&#x7ECF;&#x8FC7;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x79D2;&#x3002;</p>
<h3 id="&#x7C92;&#x5B50;&#x6570;&#x91CF;">&#x7C92;&#x5B50;&#x6570;&#x91CF;</h3>
<p>&#x6BCF;&#x79D2;&#x65B0;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x4E2A;&#x6570;&#x3002;</p>
<h3 id="&#x65CB;&#x8F6C;&#x901F;&#x5EA6;">&#x65CB;&#x8F6C;&#x901F;&#x5EA6;</h3>
<p>&#x65B0;&#x53D1;&#x5C04;&#x7C92;&#x5B50;&#x7684;&#x521D;&#x59CB;&#x8D34;&#x56FE;&#x89D2;&#x5EA6;&#x7684;&#x65CB;&#x8F6C;&#x901F;&#x5EA6;&#x3002;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x70B9;&#x7ED5;&#xFF0C;&#x7B49;&#x540C;&#x4E8E;&#x7C92;&#x5B50;&#x53D1;&#x751F;&#x5668;&#x672C;&#x8EAB;&#x5728;&#x65CB;&#x8F6C;&#xFF0C;&#x65B0;&#x53D1;&#x5C04;&#x7684;&#x7C92;&#x5B50;&#x521D;&#x59CB;&#x8D34;&#x56FE;&#x89D2;&#x5EA6;&#x7531;&#x7C92;&#x5B50;&#x53D1;&#x751F;&#x5668;&#x7684;&#x89D2;&#x5EA6;&#x51B3;&#x5B9A;&#x3002;&#x8868;&#x73B0;&#x5C31;&#x662F;&#x65B0;&#x7C92;&#x5B50;&#x7684;&#x521D;&#x59CB;&#x8D34;&#x56FE;&#x65B9;&#x5411;&#x5728;&#x4E0D;&#x65AD;&#x65CB;&#x8F6C;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5EA6;/&#x79D2;&#x3002;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<code>..\data\magic\common\ui\daqu\daquxuanze\</code>&#x4E0B;&#x7684;&#x4E24;&#x4E2A;X&#x6587;&#x4EF6;&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x504F;&#x79FB;">&#x968F;&#x673A;&#x504F;&#x79FB;</h3>
<p>&#x7C92;&#x5B50;&#x7684;&#x53D1;&#x5C04;&#x8D77;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x7C92;&#x5B50;&#x9884;&#x89C8;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x84DD;&#x7EFF;&#x7EBF;&#x6BB5;&#x6240;&#x6784;&#x6210;&#x5E73;&#x9762;&#x5185;&#x7684;&#x968F;&#x673A;&#x70B9;&#x3002;&#x5E73;&#x9762;&#x7684;&#x5927;&#x5C0F;&#x7531;&#x84DD;&#x7EFF;&#x7EBF;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#x6240;&#x51B3;&#x5B9A;&#xFF0C;&#x5373;&#x4E3A;&#x968F;&#x673A;&#x504F;&#x79FB;&#x7684;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x3002;&#x5373;&#x4F7F;&#x4E0D;&#x9700;&#x8981;&#x7C92;&#x5B50;&#x7684;&#x968F;&#x673A;&#x504F;&#x79FB;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x5728;&#x6B64;&#x5904;&#x586B;&#x5199;0&#xFF0C;&#x53EF;&#x4EE5;&#x586B;&#x5199;0.1&#x8FD9;&#x79CD;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x6570;&#x5B57;&#x8BA9;&#x968F;&#x673A;&#x504F;&#x79FB;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x586B;&#x5199;0&#x4F1A;&#x9020;&#x6210;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;BUG&#x3002;</p>
<h3 id="&#x7C92;&#x5B50;&#x5E8F;&#x5217;">&#x7C92;&#x5B50;&#x5E8F;&#x5217;</h3>
<p>&#x6709;&#x4E9B;&#x7C92;&#x5B50;&#x7684;&#x8D34;&#x56FE;&#x5E76;&#x975E;&#x5355;&#x4E00;&#x8D34;&#x56FE;&#xFF0C;&#x800C;&#x662F;&#x591A;&#x4E2A;&#x56FE;&#x7247;&#x5E8F;&#x5217;&#x7EC4;&#x6210;&#x7684;&#x77ED;&#x52A8;&#x753B;&#xFF08;&#x8FD9;&#x4E00;&#x7C7B;&#x8D34;&#x56FE;&#x5B58;&#x653E;&#x4E8E;<code>..\data\magic\textures\xulie\</code>&#x6587;&#x4EF6;&#x5939;&#x5185;&#x3002;&#x4F8B;&#x5982;&#x4E0B;&#x9762;&#x7EC4;&#x6210;&#x9ED1;&#x5CA9;&#x5DE6;&#x773C;&#x706B;&#x7130;&#x7684;&#x7C92;&#x5B50;&#x8D34;&#x56FE;&#x5E8F;&#x5217;&#xFF1A;</p>
<center>
<img src="assets/particle_sequence.png" width="30%">
</center>
&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x7C7B;&#x7684;&#x7C92;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x542F;&#x7528;&#x201C;X&#x65B9;&#x5411;&#x5E8F;&#x5217;&#x201D;&#x4E0E;&#x201C;Y&#x65B9;&#x5411;&#x5E8F;&#x5217;&#x201D;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5E76;&#x5728;&#x201C;&#x8D34;&#x56FE;&#x5E8F;&#x5217;&#x201D;&#x53C2;&#x6570;&#x5904;&#x586B;&#x5199;&#x7C92;&#x5B50;&#x8D34;&#x56FE;&#x6A2A;&#x5411;&#x4E0E;&#x7EB5;&#x5411;&#x7684;&#x5206;&#x6BB5;&#x6570;&#x91CF;&#x3002;&#x4EE5;&#x4E0A;&#x56FE;&#x4E3A;&#x4F8B;&#xFF0C;&#x6A2A;&#x7EB5;&#x5411;&#x7684;&#x5206;&#x6BB5;&#x6570;&#x91CF;&#x5747;&#x4E3A;4&#x3002;&#x5982;&#x6B64;&#x8BBE;&#x7F6E;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#xFF0C;&#x7C92;&#x5B50;&#x4FBF;&#x4F1A;&#x81EA;&#x52A8;&#x64AD;&#x653E;&#x8D34;&#x56FE;&#x5E8F;&#x5217;&#x7EC4;&#x6210;&#x7684;&#x77ED;&#x52A8;&#x753B;&#x3002;&#x65B0;&#x751F;&#x6210;&#x65F6;&#x7684;&#x7C92;&#x5B50;&#x5C06;&#x4F1A;&#x64AD;&#x653E;&#x7B2C;&#x4E00;&#x5E27;&#x5E76;&#x968F;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#x9010;&#x6B65;&#x64AD;&#x653E;&#x6BCF;&#x4E00;&#x5E27;&#xFF0C;&#x5728;&#x6D88;&#x5931;&#x4E4B;&#x524D;&#x4F1A;&#x64AD;&#x653E;&#x5230;&#x6700;&#x540E;&#x4E00;&#x5E27;&#x52A8;&#x753B;&#x3002;

### &#x7C92;&#x5B50;&#x989C;&#x8272;

&#x989C;&#x8272;&#x53C2;&#x6570;&#x5206;&#x4E3A;&#x4E09;&#x884C;&#x4E09;&#x5217;&#xFF0C;&#x5171;&#x4E5D;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x5747;&#x4E3A;0~255&#x3002;&#x4E09;&#x5217;&#x6570;&#x636E;&#x5206;&#x522B;&#x4E3A;&#x7C92;&#x5B50;&#x521A;&#x53D1;&#x5C04;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x534A;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x6D88;&#x5931;&#x65F6;&#x7684;RGB&#x989C;&#x8272;&#xFF0C;&#x5176;&#x4F59;&#x65F6;&#x95F4;&#x7684;&#x989C;&#x8272;&#x5C06;&#x7531;&#x8FD9;&#x4E09;&#x4E2A;&#x989C;&#x8272;&#x8FC7;&#x6E21;&#x5F62;&#x6210;&#x3002;&#x4F8B;&#x5982;&#x4E0B;&#x56FE;&#x4E2D;&#x7C92;&#x5B50;&#x7531;&#x521D;&#x59CB;&#x7684;&#x7EA2;&#x8272;&#x8FC7;&#x6E21;&#x4E3A;&#x7EFF;&#x8272;&#xFF0C;&#x518D;&#x8FC7;&#x6E21;&#x4E3A;&#x6D88;&#x5931;&#x65F6;&#x7684;&#x84DD;&#x8272;&#x3002;
<center>
<img src="assets/particle_color.png" width="60%">
</center>

<h3 id="&#x900F;&#x660E;&#x5EA6;">&#x900F;&#x660E;&#x5EA6;</h3>
<p>&#x5171;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x4E3A;&#x7C92;&#x5B50;&#x989C;&#x8272;&#x7684;&#x900F;&#x660E;&#x901A;&#x9053;&#x3002;&#x540C;&#x6837;&#x5206;&#x4E3A;&#x7C92;&#x5B50;&#x521A;&#x53D1;&#x5C04;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x534A;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x6D88;&#x5931;&#x65F6;&#x5171;&#x4E09;&#x4E2A;&#x900F;&#x660E;&#x5EA6;&#xFF0C;&#x53D6;&#x503C;&#x8303;&#x56F4;0~255&#x3002;</p>
<h3 id="&#x7C92;&#x5B50;&#x5927;&#x5C0F;">&#x7C92;&#x5B50;&#x5927;&#x5C0F;</h3>
<p>&#x5171;&#x4E09;&#x4E2A;&#x6570;&#x636E;&#xFF0C;&#x540C;&#x6837;&#x5206;&#x4E3A;&#x7C92;&#x5B50;&#x521A;&#x53D1;&#x5C04;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x751F;&#x547D;&#x5468;&#x671F;&#x8FC7;&#x534A;&#x65F6;&#x3001;&#x7C92;&#x5B50;&#x6D88;&#x5931;&#x65F6;&#x5171;&#x4E09;&#x4E2A;&#x5927;&#x5C0F;&#x3002;</p>
<h3 id="&#x968F;&#x673A;&#x8F6C;&#x52A8;">&#x968F;&#x673A;&#x8F6C;&#x52A8;</h3>
<p>&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x5206;&#x522B;&#x4E3A;&#x7C92;&#x5B50;&#x8F6C;&#x52A8;&#x901F;&#x5EA6;&#x7684;&#x4E0A;&#x9650;&#x4E0E;&#x4E0B;&#x9650;&#xFF0C;&#x4F8B;&#x5982;&#x586B;&#x5199;-3.0&#x548C;3.0&#xFF0C;&#x5219;&#x751F;&#x6210;&#x7684;&#x7C92;&#x5B50;&#x4F1A;&#x5728;-3.0&#x5230;3.0&#x4E4B;&#x95F4;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8D34;&#x56FE;&#x8F6C;&#x52A8;&#x901F;&#x5EA6;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x5EA6;/&#x79D2;&#x3002;</p>
<h3 id="&#x540E;&#x671F;&#x7279;&#x6548;&#x4E0E;&#x811A;&#x672C;">&#x540E;&#x671F;&#x7279;&#x6548;&#x4E0E;&#x811A;&#x672C;</h3>
<p>&#x4E0E;&#x6750;&#x8D28;&#x7684;&#x53C2;&#x6570;&#x76F8;&#x4F3C;&#xFF0C;&#x8BF7;&#x53C2;&#x8003;&#x6750;&#x8D28;&#x7AE0;&#x8282;&#x7684;&#x6B64;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x7C92;&#x5B50;&#x65E0;&#x6CD5;&#x5236;&#x4F5C;&#x9AD8;&#x5149;&#x7279;&#x6548;&#xFF0C;&#x53EA;&#x80FD;&#x5236;&#x4F5C;&#x6298;&#x5C04;&#x7279;&#x6548;&#xFF0C;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x7167;&#x4F0A;&#x5229;&#x4E9A;&#x9B54;&#x6CD5;&#x5C11;&#x5973;&#x76AE;&#x80A4;&#x7684;&#x7FC5;&#x8180;&#x3002;&#x5236;&#x4F5C;&#x6298;&#x5C04;&#x7279;&#x6548;&#x8FD8;&#x9700;&#x8981;&#x7ED9;&#x5F53;&#x524D;&#x7C92;&#x5B50;&#x6DFB;&#x52A0;&#x6298;&#x5C04;&#x811A;&#x672C;&#xFF0C;&#x7C92;&#x5B50;&#x7684;&#x540D;&#x79F0;&#x4E5F;&#x53EF;&#x4EE5;&#x9644;&#x5E26;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x3002;</p>
<p>&#xFF08;<del>&#x7EC8;&#x4E8E;&#x628A;&#x8FD9;&#x5806;&#x4E71;&#x4E03;&#x516B;&#x7CDF;&#x7684;&#x53C2;&#x6570;&#x4ECB;&#x7ECD;&#x5B8C;&#x4E86;</del>&#xFF09;</p>
<h2 id="&#x5C3E;&#x8FF9;">&#x5C3E;&#x8FF9;</h2>
<h3 id="&#x9ED1;&#x8272;&#x900F;&#x660E;">&#x9ED1;&#x8272;&#x900F;&#x660E;</h3>
<p>&#xFF08;<del>&#x4E0D;&#x7528;&#x518D;&#x8BF4;&#x4E00;&#x904D;&#x4E86;&#x5427;&#xFF0C;&#x8BB2;&#x8FC7;&#x4E24;&#x904D;&#x4E86;&#x90FD;</del>&#xFF09;</p>
<h3 id="&#x5C3E;&#x8FF9;&#x540D;&#x79F0;">&#x5C3E;&#x8FF9;&#x540D;&#x79F0;</h3>
<p>&#x540C;&#x6837;&#x9075;&#x4ECE;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x540D;&#x79F0;&#x7684;&#x7279;&#x6B8A;&#x663E;&#x793A;&#x6761;&#x4EF6;&#x3002;</p>
<h3 id="&#x5C3E;&#x8FF9;&#x5206;&#x6BB5;&#x548C;&#x5C3E;&#x8FF9;&#x957F;&#x5EA6;">&#x5C3E;&#x8FF9;&#x5206;&#x6BB5;&#x548C;&#x5C3E;&#x8FF9;&#x957F;&#x5EA6;</h3>
<p>&#x5206;&#x6BB5;&#x6570;&#x8D8A;&#x9AD8;&#xFF0C;&#x5C3E;&#x8FF9;&#x4FBF;&#x8D8A;&#x5E73;&#x6ED1;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x8FD9;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x4E58;&#x79EF;&#x6700;&#x5927;&#x662F;20&#xFF0C;&#x8D85;&#x8FC7;20&#x4E4B;&#x540E;&#x5C3E;&#x8FF9;&#x4E0D;&#x4F1A;&#x518D;&#x53D8;&#x957F;&#x3002;&#x5C3E;&#x8FF9;&#x5206;&#x6BB5;&#x7684;&#x6700;&#x5C0F;&#x503C;&#x662F;4&#xFF0C;&#x586B;&#x5199;&#x5C0F;&#x4E8E;4&#x7684;&#x503C;&#x4EA7;&#x751F;&#x7684;&#x4E5F;&#x662F;&#x7B49;&#x4E8E;4&#x7684;&#x6548;&#x679C;&#x3002;</p>
<h3 id="&#x989C;&#x8272;">&#x989C;&#x8272;</h3>
<p>&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x5C06;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#x901A;&#x9053;&#x663E;&#x793A;&#x98A0;&#x5012;&#x4E86;&#xFF0C;&#x65B0;&#x7248;&#x4E2D;&#x5DF2;&#x7ECF;&#x4FEE;&#x590D;&#x3002;&#x56DB;&#x4E2A;&#x53C2;&#x6570;&#x5206;&#x522B;&#x4E3A;&#x5C3E;&#x8FF9;&#x989C;&#x8272;&#x7684;BGRA&#x503C;&#xFF0C;&#x5C06;&#x4E0E;&#x5C3E;&#x8FF9;&#x7684;&#x8D34;&#x56FE;&#x989C;&#x8272;&#x53E0;&#x52A0;&#x5F97;&#x5230;&#x5B9E;&#x9645;&#x663E;&#x793A;&#x7684;&#x989C;&#x8272;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chapter3.html" class="navigation navigation-prev " aria-label="Previous page: 骨骼动画相关参数">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter5.html" class="navigation navigation-next " aria-label="Next page: 3ds Max相关内容">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"粒子与尾迹参数","level":"1.5","depth":1,"next":{"title":"3ds Max相关内容","level":"1.6","depth":1,"path":"Chapter5.md","ref":"Chapter5.md","articles":[]},"previous":{"title":"骨骼动画相关参数","level":"1.4","depth":1,"path":"Chapter3.md","ref":"Chapter3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter4.md","mtime":"2019-01-19T07:16:48.937Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-08T14:48:16.879Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

