
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>软件界面及基础功能 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    软件界面及基础功能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    网格渲染相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    骨骼动画相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    粒子与尾迹参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    3ds Max相关内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Chapter6.html">
            
                <a href="Chapter6.html">
            
                    
                    编辑器的指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="Share1.html">
            
                <a href="Share1.html">
            
                    
                    来自火焰库拉关于ini的分享
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="Share2.html">
            
                <a href="Share2.html">
            
                    
                    来自火焰库拉关于粒子的分享
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >软件界面及基础功能</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8F6F;&#x4EF6;&#x754C;&#x9762;&#x4E0E;&#x57FA;&#x7840;&#x529F;&#x80FD;">&#x8F6F;&#x4EF6;&#x754C;&#x9762;&#x4E0E;&#x57FA;&#x7840;&#x529F;&#x80FD;</h1>
<h2 id="x&#x6A21;&#x578B;&#x6587;&#x4EF6;&#x7B80;&#x4ECB;">X&#x6A21;&#x578B;&#x6587;&#x4EF6;&#x7B80;&#x4ECB;</h2>
<p>&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;X&#x6A21;&#x578B;&#x5305;&#x542B;&#x6709;&#x7F51;&#x683C;&#x3001;&#x6750;&#x8D28;&#x3001;&#x8D34;&#x56FE;&#x3001;&#x9AA8;&#x9ABC;&#x3001;&#x52A8;&#x753B;&#x3001;&#x7C92;&#x5B50;&#x3001;&#x5C3E;&#x8FF9;&#x4E03;&#x79CD;&#x5143;&#x7D20;&#x3002;&#x6240;&#x6709;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x53EF;&#x89C1;&#x5185;&#x5BB9;&#x90FD;&#x7531;&#x8FD9;&#x4E03;&#x79CD;&#x5143;&#x7D20;&#x6784;&#x6210;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x52A8;&#x753B;&#x5143;&#x7D20;&#x4EC5;&#x51B3;&#x5B9A;&#x4E86;&#x6BCF;&#x4E00;&#x4E2A;&#x52A8;&#x753B;&#x7247;&#x6BB5;&#x7684;&#x8D77;&#x59CB;&#x4E0E;&#x7EC8;&#x6B62;&#x5E27;&#x6570;&#xFF0C;&#x5E76;&#x4E0D;&#x4FDD;&#x5B58;&#x5B9E;&#x9645;&#x7684;&#x52A8;&#x753B;&#x6570;&#x636E;&#x3002;&#x52A8;&#x753B;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x4E8E;&#x9AA8;&#x9ABC;&#x548C;&#x6750;&#x8D28;&#x4E2D;&#x3002;</p>
<h2 id="&#x8F6F;&#x4EF6;&#x754C;&#x9762;&#x7B80;&#x4ECB;">&#x8F6F;&#x4EF6;&#x754C;&#x9762;&#x7B80;&#x4ECB;</h2>
<h3 id="&#x8F6F;&#x4EF6;&#x5DE6;&#x65B9;&#x6807;&#x7B7E;&#x680F;">&#x8F6F;&#x4EF6;&#x5DE6;&#x65B9;&#x6807;&#x7B7E;&#x680F;</h3>
<p>&#x6253;&#x5F00;&#x4E00;&#x4E2A;X&#x6587;&#x4EF6;&#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x4FE1;&#x606F;&#x680F;&#x770B;&#x5230;&#x6B64;&#x6587;&#x4EF6;&#x7684;&#x7EDF;&#x8BA1;&#x6570;&#x636E;&#xFF1A;</p>
<center>
<img src="assets/xfile_info.png" width="400">
</center>

<ul>
<li>X&#x6587;&#x4EF6;&#x7248;&#x672C;&#xFF1A;&#x76EE;&#x524D;&#x7F16;&#x8F91;&#x5668;&#x652F;&#x6301;&#x7684;&#x7248;&#x672C;&#x5305;&#x62EC;6&#x3001;7&#x3001;8&#x3002;6&#x4E3A;&#x76EE;&#x524D;&#x5927;&#x591A;&#x6570;X&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C;&#xFF0C;8&#x4E3A;&#x90E8;&#x5206;&#x65B0;&#x82F1;&#x96C4;&#x6587;&#x4EF6;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x6B64;&#x5916;&#x8FD8;&#x6709;&#x90E8;&#x5206;&#x8001;&#x82F1;&#x96C4;&#x6A21;&#x578B;&#x4E0E;&#x7279;&#x6548;&#x7248;&#x672C;&#x4E3A;5&#xFF0C;&#x65E0;&#x6CD5;&#x7F16;&#x8F91;&#x3002;</li>
<li>&#x52A8;&#x753B;&#x603B;&#x5E27;&#x6570;&#xFF1A;&#x4FDD;&#x5B58;&#x5728;&#x9AA8;&#x9ABC;&#x4E0E;&#x6750;&#x8D28;&#x4E2D;&#x7684;&#x52A8;&#x753B;&#x6570;&#x636E;&#x7684;&#x6700;&#x5927;&#x5E27;&#x6570;&#xFF0C;&#x4FEE;&#x6539;&#x52A8;&#x753B;&#x7684;&#x5E27;&#x6570;&#x65F6;&#x8BF7;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;&#x6B64;&#x6570;&#x503C;&#xFF0C;&#x8D85;&#x8FC7;&#x540E;&#x4F1A;&#x9020;&#x6210;&#x6A21;&#x578B;&#x65E0;&#x52A8;&#x753B;&#x7684;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
<p>&#x9664;&#x4FE1;&#x606F;&#x680F;&#x5916;&#x5269;&#x4F59;&#x7684;&#x4E03;&#x4E2A;&#x680F;&#x76EE;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9;&#x5E94;&#x8BE5;&#x6587;&#x4EF6;&#x5185;&#x4E00;&#x79CD;&#x5143;&#x7D20;&#x7684;&#x5217;&#x8868;&#x3002;&#x5355;&#x51FB;&#x53EF;&#x4EE5;&#x9009;&#x4E2D;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x9884;&#x89C8;&#x7A97;&#x53E3;&#x5185;&#x89C2;&#x5BDF;&#x8BE5;&#x5143;&#x7D20;&#x4F5C;&#x7528;&#x7684;&#x90E8;&#x5206;&#x3002;&#x5355;&#x51FB;&#x7A7A;&#x767D;&#x5904;&#x53EF;&#x53D6;&#x6D88;&#x9009;&#x62E9;&#xFF0C;&#x9009;&#x62E9;&#x540E;Delete&#x952E;&#x53EF;&#x4EE5;&#x5220;&#x9664;&#x5143;&#x7D20;&#x3002;&#x5728;&#x5143;&#x7D20;&#x4E0A;&#x53F3;&#x952E;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x53EF;&#x5BF9;&#x5F53;&#x524D;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x7F16;&#x8F91;&#x5373;&#x4E3A;&#x8C03;&#x6574;&#x5143;&#x7D20;&#x7684;&#x5404;&#x9879;&#x53C2;&#x6570;&#x3002;</p>
<h3 id="&#x8F6F;&#x4EF6;&#x53F3;&#x65B9;&#x9884;&#x89C8;&#x7A97;&#x53E3;">&#x8F6F;&#x4EF6;&#x53F3;&#x65B9;&#x9884;&#x89C8;&#x7A97;&#x53E3;</h3>
<p>&#x8F6F;&#x4EF6;&#x53F3;&#x65B9;&#x5373;&#x4E3A;&#x8BE5;&#x6587;&#x4EF6;&#x6548;&#x679C;&#x7684;&#x9884;&#x89C8;&#xFF0C;&#x9ED8;&#x8BA4;&#x8FD8;&#x5305;&#x62EC;&#x56DB;&#x6761;&#x7EBF;&#x6BB5;&#xFF1A;&#x7EA2;&#x8272;&#x3001;&#x7EFF;&#x8272;&#x3001;&#x84DD;&#x8272;&#x4E09;&#x6761;&#x7EBF;&#x6BB5;&#x663E;&#x793A;&#x4E86;XYZ&#x5750;&#x6807;&#x7CFB;&#x7684;&#x8F74;&#x5411;&#xFF0C;&#x7EBF;&#x6BB5;&#x957F;&#x5EA6;&#x5747;&#x4E3A;100&#x5355;&#x4F4D;&#x3002;&#x9EC4;&#x8272;&#x7EBF;&#x6BB5;&#x663E;&#x793A;&#x4E86;&#x5F53;&#x524D;&#x5149;&#x7167;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x7528;&#x4E8E;&#x9884;&#x89C8;&#x6A21;&#x578B;&#x63A5;&#x6536;&#x5149;&#x7167;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x5904;&#x663E;&#x793A;&#x7684;&#x6548;&#x679C;&#x4EC5;&#x4E3A;&#x5B9E;&#x9645;&#x6E38;&#x620F;&#x5185;&#x6548;&#x679C;&#x7684;&#x8FD1;&#x4F3C;&#xFF0C;&#x6709;&#x4E9B;&#x53C2;&#x6570;&#x8C03;&#x6574;&#x9700;&#x8FDB;&#x5165;&#x6E38;&#x620F;&#x624D;&#x80FD;&#x751F;&#x6548;&#xFF0C;&#x4E00;&#x5207;&#x53C2;&#x6570;&#x4FEE;&#x6539;&#x6548;&#x679C;&#x8BF7;&#x5747;&#x4EE5;&#x6E38;&#x620F;&#x5185;&#x6548;&#x679C;&#x4E3A;&#x51C6;&#xFF01;</strong></p>
<p>&#x5728;&#x9884;&#x89C8;&#x7A97;&#x53E3;&#x5185;&#xFF0C;&#x5DE6;&#x952E;&#x62D6;&#x52A8;&#x5373;&#x53EF;&#x6539;&#x53D8;&#x89C2;&#x5BDF;&#x6A21;&#x578B;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x9F20;&#x6807;&#x6EDA;&#x8F6E;&#x53EF;&#x8C03;&#x6574;&#x89C2;&#x5BDF;&#x8DDD;&#x79BB;&#xFF0C;&#x4E2D;&#x952E;&#x62D6;&#x52A8;&#x53EF;&#x8C03;&#x6574;&#x89C2;&#x5BDF;&#x89C6;&#x89D2;&#x7684;Z&#x65B9;&#x5411;&#x5750;&#x6807;&#xFF0C;&#x53F3;&#x952E;&#x62D6;&#x52A8;&#x53EF;&#x6539;&#x53D8;&#x9EC4;&#x8272;&#x7EBF;&#x6BB5;&#x7684;&#x65B9;&#x5411;&#x3002;</p>
<center>
<img src="assets/xfile_preview.png" width="90%">
</center>


<h4 id="&#x9009;&#x62E9;&#x5143;&#x7D20;&#x7684;&#x9884;&#x89C8;&#x6548;&#x679C;">&#x9009;&#x62E9;&#x5143;&#x7D20;&#x7684;&#x9884;&#x89C8;&#x6548;&#x679C;</h4>
<ul>
<li>&#x9009;&#x62E9;&#x7F51;&#x683C;&#x3001;&#x6750;&#x8D28;&#x3001;&#x8D34;&#x56FE;&#x7684;&#x6548;&#x679C;&#x5747;&#x4E3A;&#x4F7F;&#x4E0E;&#x5F53;&#x524D;&#x9009;&#x62E9;&#x6709;&#x5173;&#x7684;&#x7F51;&#x683C;&#x5143;&#x7D20;&#x663E;&#x793A;&#x4E3A;&#x7EA2;&#x8272;&#x3002;</li>
<li>&#x9009;&#x62E9;&#x9AA8;&#x9ABC;&#x7684;&#x6548;&#x679C;&#x4E3A;&#x5728;&#x9AA8;&#x9ABC;&#x6240;&#x5728;&#x5904;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x5750;&#x6807;&#x7CFB;&#x3002;&#x7EA2;&#x8272;&#x3001;&#x7EFF;&#x8272;&#x3001;&#x84DD;&#x8272;&#x7EBF;&#x6BB5;&#x5206;&#x522B;&#x4E3A;&#x5F53;&#x524D;&#x9AA8;&#x9ABC;&#x5750;&#x6807;&#x7CFB;&#x7684;XYZ&#x8F74;&#x5411;&#x3002;<center>
<img src="assets/bone_select.png" width="90%">
</center>


</li>
</ul>
<ul>
<li>&#x9009;&#x62E9;&#x52A8;&#x753B;&#x7684;&#x6548;&#x679C;&#x4E3A;&#x64AD;&#x653E;&#x5F53;&#x524D;&#x9009;&#x62E9;&#x7684;&#x52A8;&#x753B;&#x7247;&#x6BB5;&#x3002;</li>
<li><p>&#x9009;&#x62E9;&#x7C92;&#x5B50;&#x7684;&#x6548;&#x679C;&#x4E3A;&#x5728;&#x7C92;&#x5B50;&#x6240;&#x5728;&#x5904;&#x663E;&#x793A;&#x5982;&#x4E0B;&#x7ED3;&#x6784;&#xFF1A;</p>
<center>
<img src="assets/particle_select.png" width="90%">
</center>

<ul>
<li>&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x663E;&#x793A;&#x4E86;&#x7C92;&#x5B50;&#x7684;&#x53D1;&#x5C04;&#x65B9;&#x5411;&#xFF0C;&#x56DB;&#x6761;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x663E;&#x793A;&#x4E86;&#x8BE5;&#x7C92;&#x5B50;&#x7684;&#x968F;&#x673A;&#x53D1;&#x5C04;&#x89D2;&#x5EA6;&#xFF0C;&#x82E5;&#x968F;&#x673A;&#x89D2;&#x5EA6;&#x4E3A;&#x96F6;&#x5219;&#x53EA;&#x663E;&#x793A;&#x4E00;&#x6761;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x3002;&#x7EA2;&#x8272;&#x7EBF;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#x4EE3;&#x8868;&#x4E86;&#x7C92;&#x5B50;&#x7684;&#x53D1;&#x5C04;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x84DD;&#x8272;&#x548C;&#x7EFF;&#x8272;&#x7EBF;&#x6BB5;&#x663E;&#x793A;&#x4E86;&#x7C92;&#x5B50;&#x7684;&#x521D;&#x59CB;&#x968F;&#x673A;&#x504F;&#x79FB;&#x3002;&#x7C92;&#x5B50;&#x7684;&#x53D1;&#x5C04;&#x8D77;&#x70B9;&#x5E76;&#x4E0D;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x84DD;&#x7EFF;&#x7EBF;&#x6BB5;&#x6240;&#x6784;&#x6210;&#x5E73;&#x9762;&#x5185;&#x7684;&#x968F;&#x673A;&#x70B9;&#x3002;&#x5E73;&#x9762;&#x7684;&#x5927;&#x5C0F;&#x7531;&#x7C92;&#x5B50;&#x53C2;&#x6570;&#x968F;&#x673A;&#x504F;&#x79FB;&#x51B3;&#x5B9A;&#xFF0C;&#x663E;&#x793A;&#x4E3A;&#x84DD;&#x7EFF;&#x7EBF;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#x3002;&#x5177;&#x4F53;&#x7C92;&#x5B50;&#x7684;&#x53C2;&#x6570;&#x5C06;&#x5728;&#x4E4B;&#x540E;&#x8BB2;&#x89E3;&#x3002;</li>
<li>&#x6B64;&#x5916;&#xFF0C;&#x53D1;&#x5C04;&#x7C92;&#x5B50;&#x4F4D;&#x7F6E;&#x7684;&#x9884;&#x89C8;&#x5C06;&#x663E;&#x793A;&#x4E3A;&#x79FB;&#x52A8;&#x7684;&#x5341;&#x5B57;&#x5F62;&#x72B6;&#x3002;&#x5341;&#x5B57;&#x7EBF;&#x6BB5;&#x7684;&#x957F;&#x5EA6;&#x53CD;&#x6620;&#x4E86;&#x8BE5;&#x7C92;&#x5B50;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5341;&#x5B57;&#x7684;&#x989C;&#x8272;&#x53CD;&#x5E94;&#x8BE5;&#x7C92;&#x5B50;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5341;&#x5B57;&#x7684;&#x65CB;&#x8F6C;&#x60C5;&#x51B5;&#x540C;&#x7406;&#x3002;</li>
</ul>
</li>
<li><p>&#x9009;&#x62E9;&#x5C3E;&#x8FF9;&#x7684;&#x6548;&#x679C;&#x4E3A;&#x663E;&#x793A;&#x4E00;&#x6761;&#x7EA2;&#x7EFF;&#x6E10;&#x53D8;&#x7684;&#x7EBF;&#x6BB5;&#xFF1A;</p>
<center>
<img src="assets/trace_select.png" width="90%">
</center>

</li>
</ul>
<p>&#x7EBF;&#x6BB5;&#x7684;&#x7EA2;&#x7AEF;&#x5BF9;&#x5E94;&#x4E86;&#x5C3E;&#x8FF9;&#x7684;&#x5C3E;&#x90E8;&#xFF0C;&#x5BF9;&#x5E94;&#x8D34;&#x56FE;&#x7684;&#x4E0B;&#x65B9;&#xFF1B;&#x7EFF;&#x7AEF;&#x5BF9;&#x5E94;&#x4E86;&#x5C3E;&#x8FF9;&#x7684;&#x5934;&#x90E8;&#xFF0C;&#x5BF9;&#x5E94;&#x8D34;&#x56FE;&#x7684;&#x4E0A;&#x65B9;&#x3002;</p>
<h4 id="&#x8C03;&#x6574;&#x90E8;&#x5206;&#x5143;&#x7D20;&#x7684;&#x663E;&#x793A;">&#x8C03;&#x6574;&#x90E8;&#x5206;&#x5143;&#x7D20;&#x7684;&#x663E;&#x793A;</h4>
<ul>
<li>&#x663E;&#x793A;&#x9AA8;&#x9ABC;&#xFF1A;&#x5C06;&#x6BCF;&#x4E2A;&#x9AA8;&#x9ABC;&#x90FD;&#x663E;&#x793A;&#x4E3A;&#x767D;&#x8272;&#x7684;&#x5750;&#x6807;&#x8F74;&#x5F62;&#x72B6;&#x3002;</li>
<li>&#x663E;&#x793A;&#x7EBF;&#x6846;&#xFF1A;&#x5C06;&#x7F51;&#x683C;&#x3001;&#x7C92;&#x5B50;&#x4E0E;&#x5C3E;&#x8FF9;&#x663E;&#x793A;&#x4E3A;&#x8FB9;&#x6846;&#x6548;&#x679C;&#xFF0C;&#x7528;&#x4E8E;&#x89C2;&#x5BDF;&#x7F51;&#x683C;&#x7684;&#x5E03;&#x7EBF;&#x60C5;&#x51B5;&#x3002;</li>
<li>&#x663E;&#x793A;&#x6CD5;&#x7EBF;&#xFF1A;&#x5C06;&#x7F51;&#x683C;&#x7684;&#x6CD5;&#x7EBF;&#x663E;&#x793A;&#x4E3A;&#x7EFF;&#x8272;&#x7684;&#x7EBF;&#x6BB5;&#xFF0C;&#x7528;&#x4E8E;&#x89C2;&#x5BDF;&#x6A21;&#x578B;&#x6CD5;&#x7EBF;&#x662F;&#x5426;&#x6B63;&#x5E38;&#x3002;</li>
<li>&#x663E;&#x793A;&#x8D34;&#x56FE;&#xFF08;&#x9ED8;&#x8BA4;&#x52FE;&#x9009;&#xFF09;&#xFF1A;&#x663E;&#x793A;&#x7F51;&#x683C;&#x3001;&#x7C92;&#x5B50;&#x4E0E;&#x5C3E;&#x8FF9;&#x7684;&#x8D34;&#x56FE;&#xFF0C;&#x53D6;&#x6D88;&#x52FE;&#x9009;&#x5219;&#x663E;&#x793A;&#x6750;&#x8D28;&#x3001;&#x7C92;&#x5B50;&#x3001;&#x5C3E;&#x8FF9;&#x81EA;&#x8EAB;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x67E5;&#x770B;&#x6750;&#x8D28;&#x662F;&#x5426;&#x81EA;&#x5E26;&#x989C;&#x8272;&#x3002;<center>
<img src="assets/show_texture.png" width="90%">
</center>


</li>
</ul>
<ul>
<li>&#x663E;&#x793A;&#x7F51;&#x683C;&#xFF08;&#x9ED8;&#x8BA4;&#x52FE;&#x9009;&#xFF09;&#xFF1A;&#x53D6;&#x6D88;&#x52FE;&#x9009;&#x5219;&#x9690;&#x85CF;&#x7EA2;&#x7EFF;&#x84DD;&#x9EC4;&#x56DB;&#x6761;&#x7EBF;&#x6BB5;&#x3002;</li>
<li>&#x64AD;&#x653E;&#x52A8;&#x753B;&#xFF08;&#x9ED8;&#x8BA4;&#x52FE;&#x9009;&#xFF09;&#xFF1A;&#x53D6;&#x6D88;&#x52FE;&#x9009;&#x5219;&#x5728;&#x672A;&#x9009;&#x62E9;&#x52A8;&#x753B;&#x65F6;&#x663E;&#x793A;&#x6A21;&#x578B;&#x7684;&#x7ED1;&#x5B9A;&#x59FF;&#x52BF;&#xFF08;T-pose&#xFF09;&#x3002;</li>
</ul>
<h3 id="&#x8F6F;&#x4EF6;&#x4E0A;&#x65B9;&#x83DC;&#x5355;&#x680F;">&#x8F6F;&#x4EF6;&#x4E0A;&#x65B9;&#x83DC;&#x5355;&#x680F;</h3>
<h4 id="&#x5408;&#x5E76;&#x529F;&#x80FD;">&#x5408;&#x5E76;&#x529F;&#x80FD;</h4>
<p>&#x7528;&#x4E8E;&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;X&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x5411;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x5F15;&#x5165;&#x65B0;&#x5143;&#x7D20;&#x800C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x8F6C;&#x6362;&#x548C;&#x5BFC;&#x51FA;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x5408;&#x5E76;&#x4E4B;&#x540E;&#x7684;&#x6587;&#x4EF6;&#x5C06;&#x5305;&#x542B;&#x4E24;&#x4E2A;X&#x6587;&#x4EF6;&#x7684;&#x5168;&#x90E8;&#x5143;&#x7D20;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x5355;&#x4E2A;X&#x6587;&#x4EF6;&#x7684;&#x9AA8;&#x9ABC;&#x6570;&#x91CF;&#x4E0A;&#x9650;&#x4E3A;255&#xFF0C;&#x8D85;&#x51FA;&#x4F1A;&#x5E26;&#x6765;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x5C06;&#x4F7F;&#x5408;&#x5E76;&#x540E;&#x6587;&#x4EF6;&#x7684;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x4E3A;&#x4E24;&#x8005;&#x4E2D;&#x7684;&#x8F83;&#x5927;&#x8005;&#xFF0C;&#x5E27;&#x6570;&#x4E0D;&#x8DB3;&#x7684;&#x90E8;&#x5206;&#x5C06;&#x4EE5;&#x6700;&#x540E;&#x4E00;&#x5E27;&#x7684;&#x5185;&#x5BB9;&#x52A0;&#x4EE5;&#x586B;&#x5145;&#x3002;</p>
<p><strong>&#x8FD9;&#x662F;&#x65B0;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x7CBE;&#x9AD3;&#x4E0E;&#x6838;&#x5FC3;&#xFF0C;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5404;&#x79CD;&#x4E4B;&#x524D;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x7684;&#x64CD;&#x4F5C;&#x3002;</strong></p>
<h4 id="&#x52A8;&#x753B;&#x6A21;&#x677F;">&#x52A8;&#x753B;&#x6A21;&#x677F;</h4>
<p>&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x7684;&#x7F16;&#x8F91;&#xFF0C;&#x4FDD;&#x5B58;&#x52A8;&#x753B;&#x6A21;&#x677F;&#x5C06;&#x4F1A;&#x628A;&#x6B64;&#x6587;&#x4EF6;&#x4E2D;&#x6240;&#x6709;&#x52A8;&#x753B;&#x7684;&#x5E27;&#x6570;&#x6570;&#x636E;&#xFF08;&#x52A8;&#x753B;&#x540D;&#x79F0;&#x3001;&#x8D77;&#x59CB;&#x5E27;&#x6570;&#x3001;&#x7EC8;&#x6B62;&#x5E27;&#x6570;&#xFF09;&#x4FDD;&#x5B58;&#x4E3A;&#x4E00;&#x4E2A;json&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x53E6;&#x4E00;&#x4E2A;X&#x6587;&#x4EF6;&#x4E2D;&#x52A0;&#x8F7D;&#x76F8;&#x540C;&#x7684;&#x5E27;&#x6570;&#x6570;&#x636E;&#x3002;&#x6CE8;&#x610F;&#x5BFC;&#x5165;&#x52A8;&#x753B;&#x6A21;&#x677F;&#x5C06;&#x4F1A;&#x6E05;&#x9664;&#x5F53;&#x524D;&#x7684;&#x52A8;&#x753B;&#x6570;&#x636E;&#xFF01;</p>
<h4 id="&#x6574;&#x4F53;&#x6A21;&#x578B;&#x53D8;&#x6362;">&#x6574;&#x4F53;&#x6A21;&#x578B;&#x53D8;&#x6362;</h4>
<p>&#x6574;&#x4F53;&#x5E73;&#x79FB;&#x5C06;&#x4F7F;&#x5F53;&#x524D;&#x6587;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x5143;&#x7D20;&#x5E73;&#x79FB;&#x76F8;&#x540C;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x8F93;&#x5165;&#x65B9;&#x6CD5;&#x4E3A;&#x5C06;XYZ&#x65B9;&#x5411;&#x7684;&#x79FB;&#x52A8;&#x8DDD;&#x79BB;&#x4EE5;&#x82F1;&#x6587;&#x5206;&#x53F7;&#x5206;&#x9694;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x5E0C;&#x671B;&#x5C06;&#x6A21;&#x578B;&#x5411;X&#x65B9;&#x5411;&#x5E73;&#x79FB;10&#x5355;&#x4F4D;&#xFF0C;&#x5411;Z&#x65B9;&#x5411;&#x5E73;&#x79FB;-20&#x5355;&#x4F4D;&#xFF0C;Y&#x65B9;&#x5411;&#x4E0D;&#x53D8;&#xFF0C;&#x5219;&#x8F93;&#x5165;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>    10;0;-20
</code></pre><p>&#x6574;&#x4F53;&#x65CB;&#x8F6C;&#x5C06;&#x4F7F;&#x6240;&#x6709;&#x5143;&#x7D20;&#x6CBF;&#x6307;&#x5B9A;&#x8F74;&#x6309;&#x53F3;&#x624B;&#x7CFB;&#x65CB;&#x8F6C;&#x6307;&#x5B9A;&#x7684;&#x89D2;&#x5EA6;&#xFF0C;&#x8F93;&#x5165;&#x65B9;&#x5F0F;&#x7C7B;&#x4F3C;&#x4E8E;&#x6574;&#x4F53;&#x5E73;&#x79FB;&#xFF0C;&#x4F46;&#x662F;&#x63A8;&#x8350;&#x4E00;&#x6B21;&#x4EC5;&#x6CBF;&#x4E00;&#x4E2A;&#x8F74;&#x65CB;&#x8F6C;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x5E0C;&#x671B;&#x5C06;&#x6A21;&#x578B;&#x7ED5;X&#x8F74;&#x65CB;&#x8F6C;45&#x5EA6;&#xFF0C;&#x5219;&#x8F93;&#x5165;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>    45;0;0
</code></pre><p>&#x6574;&#x4F53;&#x7F29;&#x653E;&#x5C06;&#x4F7F;&#x6240;&#x6709;&#x5143;&#x7D20;&#x4EE5;&#x539F;&#x70B9;&#x4E3A;&#x4E2D;&#x5FC3;&#x7F29;&#x653E;&#xFF0C;&#x8F93;&#x5165;&#x4E3A;&#x4E00;&#x4E2A;&#x6D6E;&#x70B9;&#x6570;&#xFF0C;1.0&#x4E3A;&#x6A21;&#x578B;&#x539F;&#x672C;&#x5927;&#x5C0F;&#x3002;&#x5982;&#x5E0C;&#x671B;&#x5C06;&#x6A21;&#x578B;&#x653E;&#x5927;&#x4E3A;&#x539F;&#x672C;&#x7684;&#x4E24;&#x500D;&#xFF0C;&#x5219;&#x8F93;&#x5165;2.0&#x3002;&#x6CE8;&#x610F;&#x6B64;&#x529F;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x7ED9;&#x90E8;&#x5206;&#x7279;&#x6548;&#x7684;&#x7ED1;&#x5B9A;&#x4F4D;&#x7F6E;&#x5E26;&#x6765;bug&#xFF0C;&#x5982;&#x53EF;&#x80FD;&#x8BF7;&#x5C3D;&#x91CF;&#x7528;&#x4FEE;&#x6539;ini&#x6216;dat&#x7684;&#x65B9;&#x5F0F;&#x4EE3;&#x66FF;&#x3002;</p>
<p>&#x88C1;&#x526A;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x5C06;&#x820D;&#x5F03;&#x533A;&#x95F4;&#x4E4B;&#x5916;&#x7684;&#x52A8;&#x753B;&#x6570;&#x636E;&#x3002;&#x5982;&#x5E0C;&#x671B;&#x4FDD;&#x7559;100&#x5230;200&#x5E27;&#x5E76;&#x820D;&#x5F03;&#x5176;&#x4F59;&#x5E27;&#x6570;&#xFF0C;&#x5219;&#x8F93;&#x5165;&#x4E3A;&#xFF1A;</p>
<pre><code>    100;200
</code></pre><p>&#x6CE8;&#x610F;&#x88C1;&#x526A;&#x540E;&#x539F;&#x672C;&#x7684;100&#x5230;200&#x5E27;&#x5C06;&#x6210;&#x4E3A;0&#x5230;100&#x5E27;&#xFF0C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x76F8;&#x5E94;&#x7684;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x3002;&#x8F93;&#x5165;&#x7684;&#x5E27;&#x6570;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E0D;&#x8D85;&#x8FC7;&#x6587;&#x4EF6;&#x6700;&#x5927;&#x52A8;&#x753B;&#x5E27;&#x6570;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter2.html" class="navigation navigation-next " aria-label="Next page: 网格渲染相关参数">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"软件界面及基础功能","level":"1.2","depth":1,"next":{"title":"网格渲染相关参数","level":"1.3","depth":1,"path":"Chapter2.md","ref":"Chapter2.md","articles":[]},"previous":{"title":"前言","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter1.md","mtime":"2019-02-07T07:14:56.304Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-12-08T14:48:16.879Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

