
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>网格渲染相关参数 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="Chapter3.html" />
    
    
    <link rel="prev" href="Chapter1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="Chapter1.html">
            
                <a href="Chapter1.html">
            
                    
                    软件界面及基础功能
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="Chapter2.html">
            
                <a href="Chapter2.html">
            
                    
                    网格渲染相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="Chapter3.html">
            
                <a href="Chapter3.html">
            
                    
                    骨骼动画相关参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="Chapter4.html">
            
                <a href="Chapter4.html">
            
                    
                    粒子与尾迹参数
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="Chapter5.html">
            
                <a href="Chapter5.html">
            
                    
                    3ds Max相关内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="Chapter6.html">
            
                <a href="Chapter6.html">
            
                    
                    编辑器的指令系统
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="Share1.html">
            
                <a href="Share1.html">
            
                    
                    来自火焰库拉关于ini的分享
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="Share2.html">
            
                <a href="Share2.html">
            
                    
                    来自火焰库拉关于粒子的分享
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >网格渲染相关参数</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7F51;&#x683C;&#x6E32;&#x67D3;&#x76F8;&#x5173;&#x53C2;&#x6570;">&#x7F51;&#x683C;&#x6E32;&#x67D3;&#x76F8;&#x5173;&#x53C2;&#x6570;</h1>
<p>&#x6559;&#x7A0B;&#x4EC5;&#x8BB2;&#x89E3;&#x5404;&#x4E2A;&#x53C2;&#x6570;&#x5355;&#x72EC;&#x4F5C;&#x7528;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5404;&#x79CD;&#x7EC4;&#x5408;&#x6548;&#x679C;&#x8FD8;&#x8BF7;&#x5404;&#x4F4D;&#x8865;&#x4E01;&#x4F5C;&#x8005;&#x81EA;&#x884C;&#x4FEE;&#x6539;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x8D34;&#x56FE;">&#x8D34;&#x56FE;</h2>
<p>&#x8D34;&#x56FE;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x57FA;&#x672C;&#x5143;&#x7D20;&#xFF0C;&#x5BF9;&#x5E94;&#x4E86;&#x6E38;&#x620F;&#x5185;&#x7684;&#x4E00;&#x5F20;dds&#x56FE;&#x7247;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x6750;&#x8D28;&#x3001;&#x7C92;&#x5B50;&#x548C;&#x5C3E;&#x8FF9;&#x6240;&#x5F15;&#x7528;&#xFF0C;&#x4EE5;&#x663E;&#x793A;&#x76F8;&#x5E94;&#x7684;&#x7EB9;&#x7406;&#x6548;&#x679C;&#x3002;&#x5176;&#x53EF;&#x7F16;&#x8F91;&#x7684;&#x53C2;&#x6570;&#x4EC5;&#x6709;&#x4E00;&#x9879;&#xFF0C;&#x4FBF;&#x662F;&#x8D34;&#x56FE;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x540D;&#x3002;&#x6587;&#x4EF6;&#x540D;&#x540E;&#x7F00;&#x53EF;&#x4EE5;&#x662F;dds&#x6216;tga&#xFF0C;&#x5927;&#x5C0F;&#x5199;&#x5747;&#x53EF;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x53EF;&#x6CA1;&#x6709;&#x540E;&#x7F00;&#x3002;&#x8FDB;&#x5165;&#x6E38;&#x620F;&#x4E4B;&#x540E;&#x540E;&#x7F00;&#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x66FF;&#x6362;&#x4E3A;dds&#xFF0C;&#x6240;&#x4EE5;&#x6240;&#x6709;&#x8D34;&#x56FE;&#x6587;&#x4EF6;&#x90FD;&#x9700;&#x5B58;&#x50A8;&#x4E3A;dds&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x5728;&#x7F16;&#x8F91;&#x5668;&#x5916;&#x4FEE;&#x6539;&#x8FC7;&#x8D34;&#x56FE;&#x4E4B;&#x540E;&#xFF0C;&#x5728;&#x8D34;&#x56FE;&#x680F;&#x5185;&#x53F3;&#x952E;&#x3001;&#x5237;&#x65B0;&#x5373;&#x53EF;&#x66F4;&#x65B0;&#x8D34;&#x56FE;&#xFF0C;&#x65E0;&#x9700;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x3002;</p>
<h3 id="&#x52A0;&#x8F7D;&#x8DEF;&#x5F84;">&#x52A0;&#x8F7D;&#x8DEF;&#x5F84;</h3>
<p>&#x6E38;&#x620F;&#x5BFB;&#x627E;&#x8D34;&#x56FE;&#x6587;&#x4EF6;&#x7684;&#x8DEF;&#x5F84;&#x5305;&#x542B;&#x56FA;&#x5B9A;&#x7684;&#x641C;&#x7D22;&#x8DEF;&#x5F84;&#xFF0C;&#x5373;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x8A00;&#x90E8;&#x5206;&#x6DFB;&#x52A0;&#x7684;&#x9ED8;&#x8BA4;&#x641C;&#x7D22;&#x8DEF;&#x5F84;&#xFF1A;<code>..\data\magic\texture\</code>&#x4E0B;&#x7684;&#x5404;&#x4E2A;&#x5B50;&#x76EE;&#x5F55;&#x3002;&#x586B;&#x5199;&#x6B64;&#x5904;&#x7684;&#x8D34;&#x56FE;&#x540D;&#x79F0;&#x6E38;&#x620F;&#x4FBF;&#x53EF;&#x5BFB;&#x627E;&#x5230;&#x6B64;&#x8D34;&#x56FE;&#x5E76;&#x52A0;&#x8F7D;&#x3002;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x4FBF;&#x9700;&#x8981;&#x5C06;&#x8D34;&#x56FE;&#x6587;&#x4EF6;&#x4E0E;X&#x6587;&#x4EF6;&#x7F6E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x65F6;&#x586B;&#x5165;&#x8D34;&#x56FE;&#x540D;&#x79F0;&#x5373;&#x53EF;&#x88AB;&#x6E38;&#x620F;&#x52A0;&#x8F7D;&#x3002;</p>
<h3 id="&#x547D;&#x540D;&#x89C4;&#x8303;">&#x547D;&#x540D;&#x89C4;&#x8303;</h3>
<p>&#x5BF9;&#x4E8E;&#x65B0;&#x52A0;&#x5165;&#x7684;&#x989D;&#x5916;&#x8D34;&#x56FE;&#x8DEF;&#x5F84;&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x5BB9;&#x6613;&#x91CD;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x5982;<code>head.dds</code>&#xFF0C;<code>body.dds</code>&#x7B49;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4F7F;&#x7528;&#x4E2D;&#x6587;&#x547D;&#x540D;&#x3002;&#x63A8;&#x8350;&#x7684;&#x547D;&#x540D;&#x65B9;&#x5F0F;&#x4E3A;&#x5728;&#x6587;&#x4EF6;&#x540D;&#x524D;&#x65B9;&#x52A0;&#x4E0A;&#x82F1;&#x96C4;id&#x7B49;&#x80FD;&#x591F;&#x5C06;&#x4E0D;&#x540C;&#x8865;&#x4E01;&#x533A;&#x5206;&#x5F00;&#x6765;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x6BD4;&#x5982;<code>102_head.dds</code>&#xFF0C;<code>102_skin1_body.dds</code>&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E0D;&#x76F8;&#x5173;&#x8865;&#x4E01;&#x4E4B;&#x95F4;&#x7684;&#x547D;&#x540D;&#x51B2;&#x7A81;&#x3002;</p>
<h2 id="&#x6750;&#x8D28;">&#x6750;&#x8D28;</h2>
<p>&#x6750;&#x8D28;&#x662F;&#x6240;&#x6709;&#x57FA;&#x672C;&#x5143;&#x7D20;&#x4E2D;&#x552F;&#x4E00;&#x6CA1;&#x6709;&#x72EC;&#x7ACB;&#x547D;&#x540D;&#x7684;&#x5143;&#x7D20;&#xFF08;&#x96FE;&#xFF09;&#x3002;</p>
<h3 id="alpha-&#x6DF7;&#x5408;">Alpha &#x6DF7;&#x5408;</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x201C;&#x662F;&#x5426;&#x4E3A;&#x7279;&#x6548;&#x201D;&#x3002;&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x7684;&#x6548;&#x679C;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#xFF0C;&#x4E00;&#x822C;&#x5236;&#x4F5C;&#x7279;&#x6548;&#x65F6;&#x52FE;&#x9009;&#x6B64;&#x9879;&#xFF0C;&#x4EBA;&#x7269;&#x6A21;&#x578B;&#x5219;&#x4E0D;&#x52FE;&#x9009;&#x3002;&#x6B64;&#x9009;&#x9879;&#x7684;&#x6548;&#x679C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x4F7F;&#x7528;&#x6B64;&#x6750;&#x8D28;&#x7684;&#x7F51;&#x683C;&#x5C06;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x9634;&#x5F71;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x8D34;&#x56FE;&#x7684;Alpha&#x901A;&#x9053;&#x51B3;&#x5B9A;&#x900F;&#x660E;&#x5EA6;&#x3002;</li>
<li>&#x7981;&#x7528;&#x7F51;&#x683C;&#x7684;&#x6DF1;&#x5EA6;&#x7F13;&#x5B58;&#xFF0C;&#x4F7F;&#x5728;&#x5176;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x6E32;&#x67D3;&#x7684;&#x7F51;&#x683C;&#x4E0D;&#x4F1A;&#x88AB;&#x5176;&#x6240;&#x906E;&#x6321;&#xFF0C;&#x7528;&#x4E8E;&#x900F;&#x660E;&#x6216;&#x534A;&#x900F;&#x660E;&#x7684;&#x7F51;&#x683C;&#x3002;</li>
</ul>
<h3 id="alpha&#x6D4B;&#x8BD5;">Alpha&#x6D4B;&#x8BD5;</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x201C;&#x4F7F;&#x7528;&#x8D34;&#x56FE;Alpha&#x201D;&#x3002;&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x6548;&#x679C;&#x4E3A;&#x4F7F;&#x7F51;&#x683C;&#x6E32;&#x67D3;&#x65F6;&#x4F7F;&#x7528;&#x8D34;&#x56FE;&#x7684;&#x900F;&#x660E;&#x901A;&#x9053;&#x3002;&#x4E00;&#x822C;&#x5728;&#x542F;&#x7528;&#x201C;&#x662F;&#x5426;&#x4E3A;&#x7279;&#x6548;&#x201D;&#x65F6;&#x65E0;&#x9700;&#x52FE;&#x9009;&#x6B64;&#x9879;&#xFF0C;&#x56E0;&#x4E3A;&#x900F;&#x660E;&#x901A;&#x9053;&#x5DF2;&#x81EA;&#x884C;&#x751F;&#x6210;&#x3002;&#x6B64;&#x9009;&#x9879;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x6709;&#x900F;&#x660E;&#x7684;&#x975E;&#x7279;&#x6548;&#x7F51;&#x683C;&#xFF0C;&#x5982;&#x8BD7;&#x4E43;&#x98D8;&#x52A8;&#x7684;&#x56F4;&#x5DFE;&#x4E0A;&#x7684;&#x5B54;&#x6D1E;&#x3002;</p>
<center>
<img src="assets/use_alpha.png" width="60%">
</center>

<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x672A;&#x52FE;&#x9009;&#x201C;&#x662F;&#x5426;&#x4E3A;&#x7279;&#x6548;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x52FE;&#x9009;&#x6B64;&#x9009;&#x9879;&#x4EC5;&#x80FD;&#x591F;&#x5F62;&#x6210;&#x4E8C;&#x503C;&#x5316;&#x7684;&#x900F;&#x660E;&#x901A;&#x9053;&#xFF08;&#x5373;&#x8981;&#x4E48;&#x5B8C;&#x5168;&#x900F;&#x660E;&#xFF0C;&#x8981;&#x4E48;&#x5B8C;&#x5168;&#x4E0D;&#x900F;&#x660E;&#xFF0C;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x534A;&#x900F;&#x660E;&#xFF09;&#x3002;&#x4EC5;&#x53EF;&#x7528;&#x4E8E;&#x4E0A;&#x56FE;&#x7C7B;&#x4F3C;&#x7684;&#x60C5;&#x666F;&#x3002;</p>
<h3 id="&#x53CC;&#x9762;&#x6E32;&#x67D3;">&#x53CC;&#x9762;&#x6E32;&#x67D3;</h3>
<p>&#x4E3A;&#x4E86;&#x8282;&#x7701;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x6709;&#x7F51;&#x683C;&#x7684;&#x80CC;&#x9762;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x4E0D;&#x8FDB;&#x884C;&#x6E32;&#x67D3;&#x7684;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x6211;&#x4EEC;&#x89C2;&#x5BDF;&#x4E00;&#x4E9B;&#x5355;&#x9762;&#x7F51;&#x683C;&#x7684;&#x80CC;&#x9762;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x900F;&#x660E;&#x7684;&#x6548;&#x679C;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x80CC;&#x9762;&#x4E5F;&#x8FDB;&#x884C;&#x6E32;&#x67D3;&#x65F6;&#xFF0C;&#x4FBF;&#x9700;&#x52FE;&#x9009;&#x53CC;&#x9762;&#x9009;&#x9879;&#x3002;</p>
<center class="half">
<img src="assets/double_face_a.png" width="45%">
<img src="assets/double_face_b.png" width="45%">
</center>
<center>&#x6548;&#x679C;&#x5BF9;&#x6BD4;&#xFF0C;&#x6CE8;&#x610F;&#x9ED1;&#x5CA9;&#x7684;&#x98CE;&#x8863;&#x4E0B;&#x6446;</center>

<h3 id="&#x52A0;&#x6CD5;&#x6DF7;&#x5408;">&#x52A0;&#x6CD5;&#x6DF7;&#x5408;</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x201C;&#x9ED1;&#x8272;&#x900F;&#x660E;&#x201D;&#x3002;&#x4F7F;&#x7528;OpenGL&#x7684;&#x52A0;&#x6CD5;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#xFF0C;&#x52FE;&#x9009;&#x4E4B;&#x540E;&#x9ED1;&#x8272;&#x90E8;&#x5206;&#x4F1A;&#x88AB;&#x7279;&#x6548;&#x8BC6;&#x522B;&#x4E3A;&#x900F;&#x660E;&#x901A;&#x9053;&#xFF0C;&#x672A;&#x52FE;&#x9009;&#x5219;&#x53CD;&#x4E4B;&#x3002;&#x5236;&#x4F5C;&#x9ED1;&#x8272;&#x534A;&#x900F;&#x660E;&#x7279;&#x6548;&#x5373;&#x4ECE;&#x6B64;&#x5904;&#x5165;&#x624B;&#x3002;</p>
<center class="half">
<img src="assets/black_trans_a.png" width="20%">
<img src="assets/black_trans_b.png" width="20%">
</center>

<h3 id="&#x4E0D;&#x8BA1;&#x7B97;&#x5149;&#x7167;">&#x4E0D;&#x8BA1;&#x7B97;&#x5149;&#x7167;</h3>
<p>&#x52FE;&#x9009;&#x540E;&#x7F51;&#x683C;&#x4E0D;&#x53C2;&#x4E0E;&#x5149;&#x7167;&#x8BA1;&#x7B97;&#x3002;</p>
<h3 id="&#x5199;&#x5165;&#x6DF1;&#x5EA6;&#x7F13;&#x51B2;">&#x5199;&#x5165;&#x6DF1;&#x5EA6;&#x7F13;&#x51B2;</h3>
<p>&#x52FE;&#x9009;&#x540E;&#xFF0C;&#x5373;&#x4F7F;&#x5DF2;&#x52FE;&#x9009;&#x201C;Alpha&#x6DF7;&#x5408;&#x201D;&#x4E5F;&#x4F1A;&#x5199;&#x5165;&#x6DF1;&#x5EA6;&#x7F13;&#x51B2;&#xFF0C;&#x4F7F;&#x534A;&#x900F;&#x660E;&#x7F51;&#x683C;&#x5B8C;&#x5168;&#x906E;&#x6321;&#x4F4F;&#x540E;&#x9762;&#x7684;&#x6A21;&#x578B;&#x3002;</p>
<h3 id="&#x9650;&#x5236;uv">&#x9650;&#x5236;UV</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x201C;&#x4EC5;&#x5728;UV&#x53D8;&#x6362;&#x65F6;&#x663E;&#x793A;&#x201D;&#x3002;&#x6BCF;&#x4E2A;&#x6750;&#x8D28;&#x90FD;&#x4FDD;&#x5B58;&#x6709;&#x8D34;&#x56FE;&#x5750;&#x6807;&#x53D8;&#x6362;&#xFF08;&#x5373;UV&#x53D8;&#x6362;&#xFF09;&#x7684;&#x52A8;&#x753B;&#x6570;&#x636E;&#xFF0C;&#x6B64;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x653B;&#x51FB;&#x7279;&#x6548;&#xFF08;&#x6850;&#x5B50;&#x5E73;A&#x7279;&#x6548;&#xFF0C;&#x4E9A;&#x91CC;&#x4E9A;&#x8FD1;&#x7A0B;&#x5E73;A&#x7279;&#x6548;&#xFF0C;&#x8D75;&#x4E91;Q&#x7279;&#x6548;&#x7B49;&#xFF09;&#xFF0C;&#x65E7;&#x7248;&#x7684;&#x7FFB;&#x8BD1;&#x5E76;&#x4E0D;&#x51C6;&#x786E;&#xFF0C;&#x5176;&#x5B9E;&#x9645;&#x6548;&#x679C;&#x662F;&#x4F7F;&#x7F51;&#x683C;UV&#x503C;&#x8D85;&#x8FC7;&#x89C4;&#x5B9A;&#x8303;&#x56F4;&#xFF08;0&#xFF0C;1&#xFF09;&#x65F6;&#xFF0C;&#x4F7F;&#x7F51;&#x683C;&#x9690;&#x85CF;&#x3002;</p>
<center class="half">
<img src="assets/uv_show_a.png" width="45%">
<img src="assets/uv_show_b.png" width="45%">
</center>

<h3 id="uv&#x504F;&#x79FB;">UV&#x504F;&#x79FB;</h3>
<p>&#x4E0D;&#x540C;&#x4E8E;&#x4FDD;&#x5B58;&#x5728;&#x6750;&#x8D28;UV&#x52A8;&#x753B;&#x4E2D;&#x7684;&#x53D8;&#x6362;&#x6570;&#x636E;&#xFF0C;&#x6B64;&#x9879;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x4E86;&#x7F51;&#x683C;&#x7684;&#x8D34;&#x56FE;&#x5750;&#x6807;&#x4EE5;&#x4E00;&#x6052;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x8FDB;&#x884C;&#x5E73;&#x79FB;&#xFF0C;&#x7528;&#x4E8E;&#x5236;&#x4F5C;&#x4EBA;&#x7269;&#x8EAB;&#x4E0A;&#x7684;&#x6D41;&#x5149;&#x6548;&#x679C;&#xFF08;&#x9ED1;&#x5CA9;&#x4E8C;&#x6BB5;W&#xFF0C;&#x9ED1;&#x53D4;&#x66B4;&#x51FB;&#x7B49;&#xFF09;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x4E3A;&#x7279;&#x6548;&#x7F51;&#x683C;&#x90FD;&#x53EF;&#x4F7F;&#x7528;&#x3002;&#x4E3A;1.0&#x65F6;&#x5373;&#x4E3A;&#x6BCF;&#x79D2;&#x5FAA;&#x73AF;&#x56DE;&#x5230;&#x521D;&#x59CB;&#x4F4D;&#x7F6E;&#xFF0C;&#x5176;&#x4ED6;&#x6570;&#x503C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<h3 id="uv&#x5206;&#x5757;">UV&#x5206;&#x5757;</h3>
<p>&#x53EF;&#x4EE5;&#x4F7F;&#x7F51;&#x683C;&#x62E5;&#x6709;&#x7C7B;&#x4F3C;&#x7C92;&#x5B50;&#x5E8F;&#x5217;&#x7684;&#x6548;&#x679C;&#x3002;</p>
<h3 id="&#x989C;&#x8272;&#x52A8;&#x753B;">&#x989C;&#x8272;&#x52A8;&#x753B;</h3>
<p>UV&#x5206;&#x5757;&#x4E0B;&#x65B9;&#x7684;&#x989C;&#x8272;&#x6846;&#x662F;&#x6750;&#x8D28;&#x989C;&#x8272;&#x52A8;&#x753B;&#x7684;&#x9884;&#x89C8;&#xFF0C;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x3001;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#x5C55;&#x793A;&#x4E86;&#x6750;&#x8D28;&#x989C;&#x8272;&#x7684;&#x5168;&#x90E8;&#x53D8;&#x5316;&#x8FC7;&#x7A0B;&#x3002;&#x70B9;&#x51FB;&#x5373;&#x53EF;&#x53D6;&#x8272;&#xFF0C;&#x6CE8;&#x610F;&#x6B64;&#x5904;&#x4E0D;&#x80FD;&#x4FEE;&#x6539;&#x989C;&#x8272;&#xFF0C;&#x9700;&#x4FEE;&#x6539;&#x989C;&#x8272;&#x8BF7;&#x7528;&#x6750;&#x8D28;&#x5217;&#x8868;&#x4E0A;&#x65B9;&#x7684;&#x989C;&#x8272;&#x6309;&#x94AE;&#x3002;</p>
<h3 id="&#x51F9;&#x51F8;&#x7279;&#x6548;">&#x51F9;&#x51F8;&#x7279;&#x6548;</h3>
<p>&#x52FE;&#x9009;&#x540E;&#x53EF;&#x4EE5;&#x4E3A;&#x6750;&#x8D28;&#x6307;&#x5B9A;&#x51F9;&#x51F8;&#x8D34;&#x56FE;&#xFF08;&#x6CD5;&#x7EBF;&#x8D34;&#x56FE;&#xFF0C;<code>..\data\magic\textures\zheshe\</code>&#x4E0B;&#x7684;&#x8D34;&#x56FE;&#xFF0C;&#x901A;&#x5E38;&#x4EE5;&#x84DD;&#x8272;&#x4E3A;&#x4E3B;&#xFF0C;&#x5305;&#x542B;&#x5C11;&#x91CF;&#x7EA2;&#x8272;&#x4E0E;&#x7EFF;&#x8272;&#xFF09;&#x3002;&#x901A;&#x5E38;&#x4E0E;&#x6298;&#x5C04;&#x811A;&#x672C;<code>|MA:REFRACTION</code>&#x8054;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x7F51;&#x683C;&#x5177;&#x5907;&#x6298;&#x5C04;&#x7279;&#x6548;&#xFF0C;&#x80FD;&#x591F;&#x4EA7;&#x751F;&#x7C7B;&#x4F3C;&#x5149;&#x7EBF;&#x6298;&#x5C04;&#x3001;&#x7A7A;&#x6C14;&#x626D;&#x66F2;&#x7684;&#x6548;&#x679C;&#x3002;&#x7528;&#x4E8E;&#x5F88;&#x591A;&#x82F1;&#x96C4;&#x7279;&#x6548;&#x7684;&#x5236;&#x4F5C;&#x3002;&#x5177;&#x4F53;&#x8BF7;&#x53C2;&#x8003;&#x6850;&#x4EBA;W&#x3001;&#x9ED1;&#x5CA9;W&#x7B49;&#x3002;&#x6298;&#x5C04;&#x7279;&#x6548;&#x751F;&#x6548;&#x9700;&#x8981;&#x5728;&#x6E38;&#x620F;&#x8BBE;&#x7F6E;&#x4E2D;&#x52FE;&#x9009;&#x540E;&#x671F;&#x5904;&#x7406;&#x9009;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x751F;&#x6548;&#xFF08;&#x6700;&#x9AD8;&#x753B;&#x8D28;&#x4E0B;&#x9ED8;&#x8BA4;&#x542F;&#x7528;&#xFF09;&#x3002;</p>
<center>
<img src="assets/refraction.png" width="60%">
</center>

<h3 id="&#x9AD8;&#x5149;&#x7279;&#x6548;">&#x9AD8;&#x5149;&#x7279;&#x6548;</h3>
<p>&#x52FE;&#x9009;&#x540E;&#x53EF;&#x4EE5;&#x4E3A;&#x6750;&#x8D28;&#x6307;&#x5B9A;&#x9AD8;&#x5149;&#x8D34;&#x56FE;&#xFF08;&#x901A;&#x5E38;&#x4E3A;&#x9ED1;&#x767D;&#x8272;&#x8D34;&#x56FE;&#xFF09;&#x3002;&#x80FD;&#x591F;&#x5728;&#x6A21;&#x578B;&#x7279;&#x5B9A;&#x533A;&#x57DF;&#x4EA7;&#x751F;&#x80FD;&#x591F;&#x968F;&#x89C2;&#x5BDF;&#x89D2;&#x5EA6;&#x53D8;&#x5316;&#x800C;&#x53D8;&#x5316;&#x7684;&#x4EAE;&#x533A;&#x6548;&#x679C;&#x3002;&#x5177;&#x4F53;&#x8BF7;&#x53C2;&#x8003;&#x6850;&#x4EBA;&#x8863;&#x670D;&#x7684;&#x6750;&#x8D28;&#x3002;</p>
<center>
<img src="assets/high_light.png" width="60%">
</center>

<h3 id="&#x5149;&#x7167;&#x8D34;&#x56FE;">&#x5149;&#x7167;&#x8D34;&#x56FE;</h3>
<p>&#x52FE;&#x9009;&#x540E;&#x53EF;&#x4EE5;&#x4E3A;&#x6750;&#x8D28;&#x6307;&#x5B9A;&#x5149;&#x7167;&#x8D34;&#x56FE;&#xFF08;&#x901A;&#x5E38;&#x4E3B;&#x4F53;&#x4E3A;&#x7EFF;&#x8272;&#xFF0C;&#x5305;&#x542B;&#x5C11;&#x91CF;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#xFF09;&#x3002;&#x7528;&#x4E8E;&#x5FAE;&#x8C03;&#x7F51;&#x683C;&#x7684;&#x5149;&#x7167;&#x6548;&#x679C;&#x3002;</p>
<h3 id="&#x5361;&#x901A;&#x6E32;&#x67D3;">&#x5361;&#x901A;&#x6E32;&#x67D3;</h3>
<p>&#x542F;&#x7528;&#x5361;&#x901A;&#x6E32;&#x67D3;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E24;&#x5F20;&#x8D34;&#x56FE;&#xFF1A;&#x4E00;&#x5F20;&#x9AD8;&#x5149;&#x8D34;&#x56FE;&#xFF08;&#x901A;&#x5E38;&#x4E3B;&#x4F53;&#x4E3A;&#x7EFF;&#x8272;&#xFF0C;&#x5305;&#x542B;&#x5C11;&#x91CF;&#x7EA2;&#x8272;&#x548C;&#x84DD;&#x8272;&#xFF09;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x4EAE;&#x90E8;&#x4E0E;&#x6697;&#x90E8;&#x5212;&#x5206;&#xFF0C;&#x4E00;&#x5F20;&#x9634;&#x5F71;&#x8D34;&#x56FE;&#xFF08;&#x901A;&#x5E38;&#x7531;&#x4E0E;&#x6750;&#x8D28;&#x8D34;&#x56FE;&#x989C;&#x8272;&#x76F8;&#x8FD1;&#x7684;&#x8272;&#x5757;&#x7EC4;&#x6210;&#xFF09;&#x63A7;&#x5236;&#x6697;&#x90E8;&#x7684;&#x9634;&#x5F71;&#x989C;&#x8272;&#x3002;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x6548;&#x679C;&#x8FD8;&#x9700;&#x6D4B;&#x8BD5;&#x3002;</p>
<h3 id="&#x6EB6;&#x89E3;&#x7279;&#x6548;">&#x6EB6;&#x89E3;&#x7279;&#x6548;</h3>
<p>&#x6307;&#x5B9A;&#x4E00;&#x5F20;&#x6EB6;&#x89E3;&#x8D34;&#x56FE;&#xFF0C;&#x4F7F;&#x7F51;&#x683C;&#x4E2D;&#x989C;&#x8272;&#x503C;&#x5C0F;&#x4E8E;&#x4E00;&#x5B9A;&#x9608;&#x503C;&#x7684;&#x90E8;&#x5206;&#x9690;&#x85CF;&#x3002;&#x6CE8;&#x610F;&#x4F7F;&#x6EB6;&#x89E3;&#x751F;&#x6548;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x9608;&#x503C;&#x52A8;&#x753B;&#x6570;&#x636E;&#xFF0C;&#x76EE;&#x524D;&#x65E0;&#x6CD5;&#x7F16;&#x8F91;&#x3002;&#x5177;&#x4F53;&#x53C2;&#x6570;&#x6548;&#x679C;&#x8FD8;&#x9700;&#x6D4B;&#x8BD5;&#x3002;</p>
<h3 id="&#x8BBE;&#x7F6E;&#x989C;&#x8272;">&#x8BBE;&#x7F6E;&#x989C;&#x8272;</h3>
<p>&#x4F7F;&#x7528;&#x201C;&#x989C;&#x8272;&#x201D;&#x6309;&#x94AE;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x6750;&#x8D28;&#x989C;&#x8272;&#x3002;&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x6539;&#x53D8;&#x7684;&#x662F;&#x52A8;&#x753B;&#x6570;&#x636E;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6750;&#x8D28;&#x6BCF;&#x4E00;&#x5E27;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x4F46;&#x901A;&#x8FC7;&#x7F16;&#x8F91;&#x5668;&#x53EA;&#x80FD;&#x8BBE;&#x7F6E;&#x4E00;&#x79CD;&#x989C;&#x8272;&#x3002;&#x5982;&#x9700;&#x8BBE;&#x7F6E;&#x6BCF;&#x4E00;&#x5E27;&#x7684;&#x989C;&#x8272;&#x9700;&#x8981;&#x4F7F;&#x7528;3ds Max&#x3002;&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x5C06;&#x4E0E;&#x8D34;&#x56FE;&#x989C;&#x8272;&#x53E0;&#x52A0;&#xFF08;RGB&#x901A;&#x9053;&#x5206;&#x522B;&#x76F8;&#x4E58;&#xFF09;&#x51B3;&#x5B9A;&#x6A21;&#x578B;&#x7684;&#x6700;&#x7EC8;&#x989C;&#x8272;&#x3002;&#x8981;&#x4F7F;&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x4EA7;&#x751F;&#x6548;&#x679C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7F51;&#x683C;&#x4E2D;&#x7684;&#x201C;&#x6807;&#x5FD7;&#x201D;&#x9009;&#x9879;&#x4E3A;&#x201C;&#x53D8;&#x6362;&#x989C;&#x8272;&#x201D;&#x3002;</p>
<h2 id="&#x7F51;&#x683C;">&#x7F51;&#x683C;</h2>
<h3 id="&#x7F51;&#x683C;&#x540D;&#x79F0;">&#x7F51;&#x683C;&#x540D;&#x79F0;</h3>
<p>&#x6B64;&#x9879;&#x8BBE;&#x7F6E;&#x6CA1;&#x6709;&#x7279;&#x522B;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x6CE8;&#x610F;&#x6709;&#x4E9B;&#x540D;&#x79F0;&#x7684;&#x7F51;&#x683C;&#x4F1A;&#x53EA;&#x5728;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x663E;&#x793A;&#xFF08;&#x5982;&#x9ED1;&#x5CA9;&#x4E8C;&#x6BB5;W&#x7684;&#x6D41;&#x5149;&#xFF0C;&#x5C0F;&#x6697;&#x5927;&#x62DB;&#x7684;&#x7FC5;&#x8180;&#x7B49;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x7F51;&#x683C;&#x540D;&#x79F0;&#x591A;&#x4EE5;<code>_hide</code>&#x7ED3;&#x5C3E;&#xFF0C;&#x5177;&#x4F53;&#x9700;&#x8981;&#x67E5;&#x8BE2;&#x54EA;&#x4E9B;&#x7F51;&#x683C;&#x6709;&#x7279;&#x6B8A;&#x663E;&#x793A;&#x6761;&#x4EF6;&#x8BF7;&#x5728;dat&#x4E2D;&#x67E5;&#x8BE2;&#x3002;</p>
<h3 id="&#x6839;&#x9AA8;&#x9ABC;">&#x6839;&#x9AA8;&#x9ABC;</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x201C;&#x663E;&#x793A;&#x9AA8;&#x9ABC;&#x201D;&#x3002;&#x6BCF;&#x6839;&#x9AA8;&#x9ABC;&#x90FD;&#x4FDD;&#x5B58;&#x6709;&#x663E;&#x793A;&#x52A8;&#x753B;&#x6570;&#x636E;&#xFF08;&#x51B3;&#x5B9A;&#x6BCF;&#x4E00;&#x5E27;&#x662F;&#x5426;&#x663E;&#x793A;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x4E3A;&#x7F51;&#x683C;&#x6240;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x5176;&#x5728;&#x7279;&#x5B9A;&#x7684;&#x5E27;&#x6570;&#x663E;&#x793A;&#x6216;&#x9690;&#x85CF;&#xFF08;&#x5982;&#x5341;&#x9999;&#x5927;&#x62DB;&#x6B66;&#x5668;&#x7684;&#x5207;&#x6362;&#x5C31;&#x662F;&#x7528;&#x9AA8;&#x9ABC;&#x5B9E;&#x73B0;&#xFF09;&#x3002;&#x5982;&#x679C;&#x5BFC;&#x51FA;&#x7684;&#x6A21;&#x578B;&#x6709;&#x4E9B;&#x7F51;&#x683C;&#x83AB;&#x540D;&#x5176;&#x5999;&#x5730;&#x4E0D;&#x663E;&#x793A;&#xFF0C;&#x8BF7;&#x68C0;&#x67E5;&#x7F51;&#x683C;&#x540D;&#x79F0;&#x4E0E;&#x663E;&#x793A;&#x9AA8;&#x9ABC;&#x7684;&#x5E27;&#x6570;&#x3002;&#x8981;&#x4FEE;&#x6539;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8BF7;&#x770B;&#x9AA8;&#x9ABC;&#x90E8;&#x5206;&#x8BB2;&#x89E3;&#x3002;</p>
<center class="half">
<img src="assets/bone_show_a.png" width="45%">
<img src="assets/bone_show_b.png" width="45%">
</center>

<h3 id="&#x70B9;&#x9762;&#x6570;&#x91CF;">&#x70B9;&#x9762;&#x6570;&#x91CF;</h3>
<p>&#x8FD9;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6BCF;&#x4E2A;&#x7F51;&#x683C;&#x7684;&#x9876;&#x70B9;&#x6570;&#x91CF;&#x4E0E;&#x4E09;&#x89D2;&#x9762;&#x6570;&#x91CF;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x8FD9;&#x4E9B;&#x6570;&#x5B57;&#x4E0E;&#x5BFC;&#x51FA;&#x524D;3ds Max&#x7EDF;&#x8BA1;&#x7684;&#x6570;&#x5B57;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x76F8;&#x540C;&#xFF0C;&#x56E0;&#x4E3A;&#x4E09;&#x7EF4;&#x8F6F;&#x4EF6;&#x5185;&#x7684;&#x9762;&#x4E00;&#x822C;&#x5E76;&#x975E;&#x4E09;&#x89D2;&#x9762;&#xFF0C;&#x8FD8;&#x53D7;&#x5230;&#x5E73;&#x6ED1;&#x7B49;&#x4FEE;&#x6539;&#x5668;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5BFC;&#x51FA;&#x540E;&#x70B9;&#x9762;&#x6570;&#x91CF;&#x53EF;&#x80FD;&#x4F1A;&#x7FFB;&#x51E0;&#x500D;&#x3002;</p>
<p>&#x7531;&#x4E8E;X&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5355;&#x4E2A;&#x7F51;&#x683C;&#x7684;&#x9876;&#x70B9;&#x6570;&#x91CF;&#x4E0D;&#x53EF;&#x8D85;&#x8FC7;32767&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#x5EFA;&#x8BAE;&#x6574;&#x4E2A;&#x4EBA;&#x7269;&#x6A21;&#x578B;&#x7684;&#x9876;&#x70B9;&#x548C;&#x9762;&#x603B;&#x6570;&#x4E0D;&#x8D85;&#x8FC7;1&#x4E07;&#x5DE6;&#x53F3;&#xFF0C;&#x5426;&#x5219;&#x4F1A;&#x51FA;&#x73B0;&#x5E27;&#x7387;&#x964D;&#x4F4E;&#x3001;&#x52A0;&#x8F7D;&#x5361;&#x987F;&#x7B49;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x5B9E;&#x5728;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7684;&#x70B9;&#x9762;&#x6570;&#x91CF;&#xFF0C;&#x8BF7;&#x5C06;&#x6A21;&#x578B;&#x62C6;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x7F51;&#x683C;&#x3002;</p>
<h3 id="&#x7F51;&#x683C;&#x7C7B;&#x578B;">&#x7F51;&#x683C;&#x7C7B;&#x578B;</h3>
<p>&#x5BF9;&#x5E94;&#x65E7;&#x7248;&#x7F16;&#x8F91;&#x5668;&#x201C;&#x6807;&#x5FD7;&#x201D;&#x3002;&#x5E38;&#x89C1;&#x503C;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x56FA;&#x5B9A;&#x989C;&#x8272;&#xFF1A;&#x5FFD;&#x7565;&#x6750;&#x8D28;&#x52A8;&#x753B;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x6570;&#x636E;&#xFF0C;&#x4F7F;&#x7528;&#x8D34;&#x56FE;&#x989C;&#x8272;&#x3002;</li>
<li>&#x56FA;&#x5B9A;&#x65B9;&#x5411;&#xFF1A;&#x9700;&#x8981;&#x4E0E;&#x201C;&#x59CB;&#x7EC8;&#x5411;&#x4E0A;&#x201D;&#x6216;&#x201D;&#x5782;&#x76F4;&#x5730;&#x9762;&#x201C;&#x8054;&#x5408;&#x4F7F;&#x7528;&#x3002;<ul>
<li>&#x5F53;&#x52FE;&#x9009;&#x201C;&#x59CB;&#x7EC8;&#x5411;&#x4E0A;&#x201D;&#x65F6;&#xFF1A;&#x4F7F;&#x7F51;&#x683C;&#x6C38;&#x8FDC;&#x671D;&#x4E0A;&#xFF0C;&#x5373;&#x5E73;&#x884C;&#x4E0E;&#x5730;&#x9762;&#x3002;</li>
<li>&#x5F53;&#x52FE;&#x9009;&#x201C;&#x5782;&#x76F4;&#x5730;&#x9762;&#x201D;&#x65F6;&#xFF1A;&#x4F7F;&#x7F51;&#x683C;&#x5782;&#x76F4;&#x4E8E;&#x5730;&#x9762;&#xFF0C;&#x540C;&#x65F6;&#x6B63;&#x9762;&#x671D;&#x5411;&#x6444;&#x50CF;&#x673A;&#x3002;</li>
<li>&#x5F53;&#x5747;&#x4E0D;&#x52FE;&#x9009;&#xFF1A;&#x4F7F;&#x7F51;&#x683C;&#x5982;&#x540C;&#x7C92;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x6BCF;&#x4E2A;&#x9762;&#x90FD;&#x671D;&#x5411;&#x73A9;&#x5BB6;&#x7684;&#x89C6;&#x89D2;&#x800C;&#x4E0D;&#x662F;&#x8DDF;&#x968F;&#x89D2;&#x8272;&#x8F6C;&#x52A8;&#xFF08;&#x5982;&#x5C0F;&#x5706;&#x9B54;&#x5973;&#x76AE;&#x80A4;&#x624B;&#x8155;&#x548C;&#x80A9;&#x4E0A;&#x5B9D;&#x77F3;&#x7684;&#x5149;&#x8292;&#xFF09;&#x3002;</li>
</ul>
</li>
<li>&#x53D8;&#x6362;&#x989C;&#x8272;&#xFF1A;&#x4F7F;&#x7528;&#x6750;&#x8D28;&#x52A8;&#x753B;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x989C;&#x8272;&#x6570;&#x636E;&#xFF0C;&#x663E;&#x793A;&#x6750;&#x8D28;&#x4E0E;&#x8D34;&#x56FE;&#x989C;&#x8272;&#x7684;&#x53E0;&#x52A0;&#x3002;</li>
<li>&#x5730;&#x9762;&#x3001;&#x78B0;&#x649E;&#x7BB1;&#xFF1A;&#x5728;&#x5C11;&#x90E8;&#x5206;&#x6587;&#x4EF6;&#x4E2D;&#x51FA;&#x73B0;&#xFF08;&#x5730;&#x56FE;&#x6A21;&#x578B;&#xFF0C;&#x5E7B;&#x523A;&#x7684;&#x6A21;&#x578B;&#xFF09;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
<center class="half">
<img src="assets/toward_camera_a.png" height="200">
<img src="assets/toward_camera_b.png" height="200">
</center>

<h3 id="&#x811A;&#x672C;">&#x811A;&#x672C;</h3>
<p>&#x6E38;&#x620F;&#x5185;&#x5F88;&#x591A;&#x7F51;&#x683C;&#x90FD;&#x5E26;&#x6709;&#x811A;&#x672C;&#x8FD9;&#x4E00;&#x53C2;&#x6570;&#xFF0C;&#x51FA;&#x73B0;&#x8FC7;&#x7684;&#x811A;&#x672C;&#x603B;&#x6570;&#x5E76;&#x4E0D;&#x591A;&#xFF0C;&#x4F46;&#x5176;&#x4E2D;&#x5F88;&#x591A;&#x90FD;&#x5C1A;&#x4E0D;&#x6E05;&#x695A;&#x5176;&#x5177;&#x4F53;&#x4F5C;&#x7528;&#x3002;&#x4E00;&#x4E2A;&#x7F51;&#x683C;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x811A;&#x672C;&#xFF0C;&#x7528;&#x56DE;&#x8F66;&#x9694;&#x5F00;&#xFF0C;&#x4E00;&#x884C;&#x4E00;&#x4E2A;&#x3002;&#x5E38;&#x89C1;&#x7684;&#x811A;&#x672C;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><code>|RF:NLIGHT</code>&#xFF1A;&#x9694;&#x7EDD;&#x5149;&#x7167;&#x6548;&#x679C;&#x5BF9;&#x6B64;&#x7F51;&#x683C;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x59CB;&#x7EC8;&#x663E;&#x793A;&#x6700;&#x660E;&#x4EAE;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x591A;&#x89C1;&#x4E8E;&#x6709;&#x81EA;&#x53D1;&#x5149;&#x5C5E;&#x6027;&#x7684;&#x7279;&#x6548;&#x7F51;&#x683C;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x57FA;&#x672C;&#x6240;&#x6709;&#x7528;&#x4E8E;&#x7279;&#x6548;&#x7684;&#x7F51;&#x683C;&#x90FD;&#x6709;&#x6B64;&#x811A;&#x672C;&#xFF0C;&#x5982;&#x679C;&#x89C9;&#x5F97;&#x6709;&#x4E9B;&#x7279;&#x6548;&#x7F51;&#x683C;&#x5F88;&#x6697;&#xFF0C;&#x4E0D;&#x59A8;&#x8BD5;&#x8BD5;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x3002;</li>
<li><code>|MA:REFRACTION</code>&#xFF1A;&#x6298;&#x5C04;&#x811A;&#x672C;&#xFF0C;&#x4E3A;&#x9700;&#x8981;&#x4EA7;&#x751F;&#x6298;&#x5C04;&#x6548;&#x679C;&#x7684;&#x7F51;&#x683C;&#x6DFB;&#x52A0;&#x6B64;&#x811A;&#x672C;&#x624D;&#x80FD;&#x4F7F;&#x5BF9;&#x4E8E;&#x6750;&#x8D28;&#x7684;&#x66F4;&#x6539;&#x751F;&#x6548;&#xFF0C;&#x9700;&#x8981;&#x5F00;&#x542F;&#x540E;&#x671F;&#x5904;&#x7406;&#x3002;</li>
<li><code>|MA:EMISSIVE</code>&#xFF1A;&#x6CDB;&#x5149;&#x811A;&#x672C;&#xFF0C;&#x4E3A;&#x7F51;&#x683C;&#x8F83;&#x4EAE;&#x7684;&#x90E8;&#x5206;&#x5468;&#x56F4;&#x4EA7;&#x751F;&#x67D4;&#x548C;&#x7684;&#x5149;&#x4EAE;&#xFF0C;&#x9700;&#x8981;&#x5F00;&#x542F;&#x540E;&#x671F;&#x5904;&#x7406;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4EA7;&#x751F;&#x7684;&#x5149;&#x6655;&#x5C0F;&#x5230;&#x96BE;&#x4EE5;&#x5BDF;&#x89C9;&#xFF0C;&#x5236;&#x4F5C;&#x6CDB;&#x5149;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x7528;&#x5341;&#x5B57;&#x4EA4;&#x53C9;&#x7F51;&#x683C;&#x5236;&#x4F5C;&#x3002;</li>
</ul>
<p>&#x5176;&#x4ED6;&#x51FA;&#x73B0;&#x8FC7;&#x4F46;&#x662F;&#x4E0D;&#x6E05;&#x695A;&#x5177;&#x4F53;&#x4F5C;&#x7528;&#x7684;&#x811A;&#x672C;&#xFF1A;</p>
<ul>
<li><code>|GE:ONFLOOR</code></li>
<li><code>|RF:DEPTHFIRST</code></li>
<li><code>|RF:FIXEDSCALE</code></li>
<li><code>|RF:NSHADOWCACHE</code></li>
<li><code>|RO:4</code></li>
<li><code>|MO:PERFRAME</code></li>
<li><code>|MO:RANDOMFRAME</code></li>
</ul>
<p>&#x90E8;&#x5206;&#x672A;&#x51FA;&#x73B0;&#x8FC7;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x731C;&#x6D4B;&#x5176;&#x6548;&#x679C;&#x7684;&#x811A;&#x672C;&#xFF1A;</p>
<ul>
<li><code>|RF:ONLYCASTSHADOW</code>&#xFF1A;&#x53EA;&#x4EA7;&#x751F;&#x9634;&#x5F71;&#xFF0C;&#x4E0D;&#x6E32;&#x67D3;&#x7F51;&#x683C;&#x672C;&#x4F53;&#x3002;</li>
<li><code>|RF:NCASTSHADOW</code>&#xFF1A;&#x4E0D;&#x4EA7;&#x751F;&#x9634;&#x5F71;&#xFF0C;&#x53EA;&#x6E32;&#x67D3;&#x7F51;&#x683C;&#x672C;&#x4F53;&#x3002;</li>
<li><code>|RF:NRECEIVESHADOW</code>&#xFF1A;&#x4E0D;&#x63A5;&#x6536;&#x5176;&#x4ED6;&#x7F51;&#x683C;&#x4EA7;&#x751F;&#x7684;&#x9634;&#x5F71;&#x3002;</li>
</ul>
<p>&#x5BF9;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x8865;&#x4E01;&#x5236;&#x4F5C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7279;&#x6548;&#x7F51;&#x683C;&#x6DFB;&#x52A0;<code>|RF:NLIGHT</code>&#x811A;&#x672C;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x5B8C;&#x6574;&#x7684;&#x811A;&#x672C;&#x5217;&#x8868;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x7FA4;&#x6587;&#x4EF6;&#x3002;&#x6240;&#x6709;&#x811A;&#x672C;&#x7684;&#x6548;&#x679C;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x5185;&#x5747;&#x65E0;&#x6CD5;&#x9884;&#x89C8;&#xFF0C;&#x9700;&#x8FDB;&#x5165;&#x6E38;&#x620F;&#x67E5;&#x770B;&#x3002;</p>
<h3 id="&#x7FFB;&#x8F6C;&#x6CD5;&#x7EBF;">&#x7FFB;&#x8F6C;&#x6CD5;&#x7EBF;</h3>
<p>&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x6709;&#x65F6;&#x5BFC;&#x51FA;bug&#x4F1A;&#x4F7F;&#x67D0;&#x4E9B;&#x7F51;&#x683C;&#x7684;&#x6CD5;&#x7EBF;&#x65B9;&#x5411;&#x5168;&#x90E8;&#x53CD;&#x8F6C;&#xFF0C;&#x6B64;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x8C03;&#x6574;&#x7F51;&#x683C;&#x7684;&#x6CD5;&#x7EBF;&#x65B9;&#x5411;&#x3002;</p>
<h3 id="&#x4E0A;&#x79FB;&#x4E0E;&#x4E0B;&#x79FB;">&#x4E0A;&#x79FB;&#x4E0E;&#x4E0B;&#x79FB;</h3>
<p>&#x4E0A;&#x79FB;&#x548C;&#x4E0B;&#x79FB;&#x80FD;&#x591F;&#x8C03;&#x6574;&#x67D0;&#x4E2A;&#x7F51;&#x683C;&#x5728;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x770B;&#x4F3C;&#x5E76;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4F5C;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x7F51;&#x683C;&#x5728;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x6070;&#x6070;&#x5C31;&#x662F;&#x5176;&#x5728;&#x6E38;&#x620F;&#x4E2D;&#x7684;&#x6E32;&#x67D3;&#x987A;&#x5E8F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x7279;&#x6548;&#x6587;&#x4EF6;&#x800C;&#x8A00;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x7F51;&#x683C;&#x987A;&#x5E8F;&#x6765;&#x4FEE;&#x6B63;&#x4E00;&#x4E9B;&#x7981;&#x7528;&#x6DF1;&#x5EA6;&#x7F13;&#x5B58;&#x7684;&#x7F51;&#x683C;&#x7684;&#x906E;&#x6321;&#x5173;&#x7CFB;&#x3002;</p>
<h3 id="&#x8C03;&#x6574;&#x7F51;&#x683C;&#x663E;&#x793A;&#x5E27;&#x6570;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;">&#x8C03;&#x6574;&#x7F51;&#x683C;&#x663E;&#x793A;&#x5E27;&#x6570;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;</h3>
<ol>
<li>&#x4F7F;&#x7528;&#x663E;&#x793A;&#x9AA8;&#x9ABC;&#x65B9;&#x5F0F;&#x3002;&#x7528;3ds Max&#x8BBE;&#x7F6E;&#x67D0;&#x4E00;&#x6839;&#x9AA8;&#x9ABC;&#x7684;&#x663E;&#x793A;&#x5E27;&#x6570;&#x52A8;&#x753B;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x7F51;&#x683C;&#x7684;&#x663E;&#x793A;&#x9AA8;&#x9ABC;&#x8BBE;&#x4E3A;&#x6B64;&#x9AA8;&#x9ABC;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x6750;&#x8D28;&#x900F;&#x660E;&#x5EA6;&#x52A8;&#x753B;&#x3002;&#x6750;&#x8D28;&#x7684;&#x989C;&#x8272;&#x52A8;&#x753B;&#x4E0D;&#x4EC5;&#x5305;&#x542B;RGB&#x901A;&#x9053;&#xFF0C;&#x8FD8;&#x5305;&#x542B;&#x900F;&#x660E;&#x901A;&#x9053;&#x3002;&#x6750;&#x8D28;&#x7684;&#x900F;&#x660E;&#x901A;&#x9053;&#x4E5F;&#x4F1A;&#x5BF9;&#x7F51;&#x683C;&#x7684;&#x663E;&#x793A;&#x9020;&#x6210;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x5C06;&#x7F51;&#x683C;&#x7684;&#x6807;&#x5FD7;&#x8BBE;&#x4E3A;&#x53D8;&#x6362;&#x989C;&#x8272;&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x6750;&#x8D28;&#x8D34;&#x56FE;&#x5750;&#x6807;&#x52A8;&#x753B;&#x3002;&#x8BE6;&#x60C5;&#x89C1;&#x6750;&#x8D28;&#x7684;&#x201C;&#x4EC5;&#x5728;UV&#x53D8;&#x6362;&#x65F6;&#x663E;&#x793A;&#x201D;&#x53C2;&#x6570;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#x4E09;&#x79CD;&#x8BBE;&#x7F6E;&#x7F51;&#x683C;&#x5728;&#x7279;&#x5B9A;&#x5E27;&#x6570;&#x663E;&#x793A;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x7B2C;&#x4E00;&#x79CD;&#x53EF;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x5185;&#x5B8C;&#x6210;&#xFF0C;&#x65B9;&#x6CD5;&#x89C1;&#x9AA8;&#x9ABC;&#x53C2;&#x6570;&#x8BE6;&#x89E3;&#x3002;&#x540E;&#x4E24;&#x79CD;&#x4EC5;&#x80FD;&#x4F7F;&#x7528;3ds Max&#x751F;&#x6210;&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E8C;&#x79CD;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8BA9;&#x7F51;&#x683C;&#x9010;&#x6E10;&#x9690;&#x85CF;&#x9010;&#x6E10;&#x663E;&#x73B0;&#xFF0C;&#x5B9E;&#x73B0;&#x900F;&#x660E;&#x5EA6;&#x7684;&#x6E10;&#x53D8;&#xFF0C;&#x800C;&#x5176;&#x4F59;&#x4E24;&#x79CD;&#x65E0;&#x6CD5;&#x505A;&#x5230;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="Chapter1.html" class="navigation navigation-prev " aria-label="Previous page: 软件界面及基础功能">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="Chapter3.html" class="navigation navigation-next " aria-label="Next page: 骨骼动画相关参数">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"网格渲染相关参数","level":"1.3","depth":1,"next":{"title":"骨骼动画相关参数","level":"1.4","depth":1,"path":"Chapter3.md","ref":"Chapter3.md","articles":[]},"previous":{"title":"软件界面及基础功能","level":"1.2","depth":1,"path":"Chapter1.md","ref":"Chapter1.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"Chapter2.md","mtime":"2022-05-24T01:50:38.839Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-05-24T01:52:15.846Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

